{
  "musique": {
    "answerable": [],
    "unanswerable": [
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The White armored car was a series of armored cars developed by the White Motor Company in Cleveland, Ohio from 1915.\n Paragraph 2: The 100 (pronounced The Hundred) is an American post-apocalyptic science fiction drama television series developed by Jason Rothenberg, which premiered on March 19, 2014, on The CW. It is loosely based on a 2013 book of the same name, the first in a book series by Kass Morgan. The series follows a group of teens as they become the first people from a space habitat to return to Earth after a devastating nuclear apocalypse.\n Paragraph 3: Parc Safari is a zoo in Hemmingford, Quebec, Canada, and is one of the region's major tourist attractions; that has both African & Asian species of elephant.\nQuestion: Who developed the eponymous character from the series that contains Mickey's Safari in Letterland?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Walt Disney\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Almost all growth will take place in the less developed regions, where today's 5.3 billion population of underdeveloped countries is expected to increase to 7.8 billion in 2050. By contrast, the population of the more developed regions will remain mostly unchanged, at 1.2 billion. An exception is the United States population, which is expected to increase by 44% from 2008 to 2050.\n Paragraph 2: Khong Island or Don Khong is the largest island and the seat of administration in the Si Phan Don riverine archipelago located in the Mekong River, Khong District, Champasak Province, southern Laos.\n Paragraph 3: Dornogovi (, \"East Gobi\") is one of the 21 aimags (provinces) of Mongolia. It is located in the southeast of the country, bordering PR China's autonomous region of Inner Mongolia.\n Paragraph 4: Khong is a district (\"muang\") of Champassack Province in southwestern Laos. The district borders Cambodia in the far south and is famous for the Khonephapheng Waterfalls and the Si Phan Don (4000 Islands) area.\n Paragraph 5: The end of World War II brought a baby boom to many countries, especially Western ones. There is some disagreement as to the precise beginning and ending dates of the post-war baby boom, but it is most often agreed to have begun in the years immediately after the war, though some place it earlier at the increase of births in 1941 - 1943. The boom started to decline as birth rates in the United States started to decline in 1958, though the boom would only grind to a halt 3 years later in 1961, 20 years after it began.\nQuestion: In what region of the country containing A Lưới is the birthplace of John Phan located?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"South Central Coast\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Problem Child 3 is a 1995 American made-for-television film and the third and final installment of the \"Problem Child\" trilogy. However, it sets off completely different from the second film. In it, Junior is a preteen and is in love with a girl named Tiffany. However, she does not notice him. Things take a mischievous turn when he finds out there are three other boys interested in her as well. In this installment, he is portrayed by Justin Chapman and Ben is portrayed by William Katt. Neither Annie (Amy Yasbeck) nor Trixie (Ivyann Schwan) appear in it, nor are they mentioned. Gilbert Gottfried and Jack Warden are the only cast members to appear in all three films. It neither explains how Big Ben is still rich, since his apparent new wife, LaWanda Dumore, is never mentioned, nor how Mr. Peabody went from being a school principal to a dentist. It aired on May 13, 1995 on NBC.\n Paragraph 2: Love in Pawn is a 1953 British comedy film directed by Charles Saunders and starring Bernard Braden and Barbara Kelly.\nQuestion: Who is the child of the actor who is a cast member of Love in Pawn?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Kim Braden\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The City of Yuma is a Home Rule Municipality that is the most populous city in Yuma County, Colorado, United States. The population was 3,524 at the 2010 census.\n Paragraph 2: The Grace Keiser Maring Library is located on the south side of Muncie, Indiana, USA. Built at 1808 South Madision Street, the library is next to Heekin Park, the largest and oldest community park in Muncie. The library was the first branch library built in the city.\n Paragraph 3: The J. Erik Jonsson Central Library is the Main Library Branch of the Dallas Public Library system. It is located at 1515 Young Street in the Government District of downtown Dallas, Texas, directly across from Dallas City Hall.\n Paragraph 4: After a hiatus of eleven years, the race was revived by the Verizon IndyCar Series in 2016. It was held on Saturday night under the lights. Long considered a popular Indy car track, Phoenix has a rich history of open wheel races, including a spectacular crash involving Johnny Rutherford (1980), and the final career victory for Indy legend Mario Andretti (1993).\nQuestion: Who won the Indy Car Race in the largest populated city of the state where Yuma's Library District is located?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Mario Andretti\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Bhilangna River is a Himalayan river in Uttarakhand, India, which is the major tributary of the Bhagirathi river, the source stream of the Ganges River of India.\n Paragraph 2: The Kraai River originates in the mountains south of Lesotho and flows westward from the confluence of the Bell River and the Sterkspruit at Moshesh's Ford at all the way to Aliwal North, where it joins the Orange River at .\n Paragraph 3: The Kabompo River is one of the main tributaries of the upper Zambezi River. It flows entirely in Zambia, rising to the east of the source of the Zambezi, in North-Western Province along the watershed between the Zambezi and Congo river basins which also forms the border between Zambia and DR Congo.\n Paragraph 4: The Kizir River (Кизир) is a right tributary of the Kazyr River. It flows for about through the Eastern Sayan Mountains in the Krasnoyarsk Krai of Russia. Its source is located in the Kryzhina Ridge. The river contains many cataracts which make it popular with Siberian rafters. Another tourist attraction is the Kinzelyuk Waterfall, one of the highest in Asia.\nQuestion: What is the source of the river of which Kraai River is a tributary?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Thaba Putsoa\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: ``Penny Lane ''is a song by the English rock band the Beatles. It was written primarily by Paul McCartney but credited to the Lennon -- McCartney songwriting partnership. The lyrics refer to Penny Lane, a street in Liverpool, and make mention of the sights and characters that McCartney recalled from his upbringing in the city.\n Paragraph 2: \"It's for You\" is a song written by John Lennon and Paul McCartney of the Beatles for Cilla Black for whom it was a UK Top Ten hit in 1964. The song is mainly a McCartney composition.\n Paragraph 3: Julian Lennon was born on 8 April 1963 in Liverpool. He was named after his paternal grandmother, Julia Lennon. The Beatles' manager, Brian Epstein, was his godfather.\nQuestion: What song did Paul McCartney write for Sean Lennon's siblings?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"``Hey Jude ''\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The PEN/Diamonstein-Spielvogel Award for the Art of the Essay is awarded by the PEN American Center to an author for a book of original collected essays. The award was founded by PEN Member and author Barbaralee Diamonstein and Carl Spielvogel, former \"New York Times\" columnist, \"to preserve the dignity and esteem that the essay form imparts to literature.\" The winner receives a cash award of $10,000.\n Paragraph 2: The Nobel Prize in Literature (Swedish: Nobelpriset i litteratur) is a Swedish literature prize that is awarded annually, since 1901, to an author from any country who has, in the words of the will of Swedish industrialist Alfred Nobel, produced ``in the field of literature the most outstanding work in an ideal direction ''(original Swedish:`` den som inom litteraturen har producerat det mest framstående verket i en idealisk riktning''). Though individual works are sometimes cited as being particularly noteworthy, the award is based on an author's body of work as a whole. The Swedish Academy decides who, if anyone, will receive the prize. The academy announces the name of the laureate in early October. It is one of the five Nobel Prizes established by the will of Alfred Nobel in 1895. It will not be awarded in 2018, but two names will be awarded in 2019.\n Paragraph 3: Haig Aram Bosmajian (March 26, 1928- June 17, 2014) was an author, lecturer, and professor, who received the 1983 Orwell Award for his book \"The Language of Oppression\" (1974). Haig Bosmajian received a PhD in 1960 from Stanford University. His work has explored rhetoric and the freedom of speech. Bosmajian was professor emeritus at the University of Washington, in the Speech/Communications Department, where he taught since 1965. He was married for 57 years to Hamida Bosmajian, also a published author and a professor at nearby Seattle University.\nQuestion: What award was received by the person who authored Missing Person?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Nobel Prize in Literature\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Chugwater Creek is a tributary of the Laramie River in southeastern Wyoming in the United States. The stream rises northeast of Laramie, in the Laramie Mountains in eastern Albany County and flows . It flows northeast, emerges from the mountains and flows past Chugwater, where it turns north-northwest, and flows past Slater. Chugwater Creek joins the Laramie approximately northeast of Wheatland.\n Paragraph 2: Toongabbie Creek, an urban watercourse that is part of the Parramatta River catchment, is located in Greater Western Sydney, New South Wales, Australia.\n Paragraph 3: The River Ravensbourne is a tributary of the River Thames in south London, England. It flows into the tidal River Thames at Deptford, where its tidal reach is known as Deptford Creek.\nQuestion: What body of water does the river that Toongabbie Creek flows into flow into?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Sydney Harbour\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Kwe Kwe River is a small river that runs by the town of Kwekwe in Zimbabwe. It is a lesser tributary of the Sebakwe River and it joins the Sebakwe River north of the town. The water from the river is used by the steel industry that forms the backbone of the town of Kwekwe. The Sebakwe River is a tributary of the mighty Zambezi River.\n Paragraph 2: Tatarka River () is a river in Perm Krai, Russia, a right bank tributary of the Babka River, which in turn is a tributary of the Sylva River. The river is long.\n Paragraph 3: The Kraai River originates in the mountains south of Lesotho and flows westward from the confluence of the Bell River and the Sterkspruit at Moshesh's Ford at all the way to Aliwal North, where it joins the Orange River at .\n Paragraph 4: The Mearim River is a river in Maranhão state of northern Brazil. The river originates in the southern part of Maranhão, and drains north into the Baía de São Marcos, an estuary that also receives the Pindaré and Grajaú rivers, which are sometimes considered tributaries of the Mearim. The lower Mearim is known for its pororoca, or tidal bore.\nQuestion: Where is the origin of the river that Kraai River is a tributary of?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Thaba Putsoa\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Mamaroneck River is a freshwater stream located in Southern Westchester County, New York. The river forms in White Plains and Harrison and flows south through Mamaroneck Town and Village, where it empties into Mamaroneck Harbor and Long Island Sound. The name of the river comes from a local native American word meaning, \"where the fresh water meets the salt water.\" The river flows into Long Island Sound.\n Paragraph 2: The first commercially successful true engine, in that it could generate power and transmit it to a machine, was the atmospheric engine, invented by Thomas Newcomen around 1712. It was an improvement over Savery's steam pump, using a piston as proposed by Papin. Newcomen's engine was relatively inefficient, and in most cases was used for pumping water. It worked by creating a partial vacuum by condensing steam under a piston within a cylinder. It was employed for draining mine workings at depths hitherto impossible, and also for providing a reusable water supply for driving waterwheels at factories sited away from a suitable \"head\". Water that had passed over the wheel was pumped back up into a storage reservoir above the wheel.\n Paragraph 3: The Rainy River is a river in Presque Isle County, Michigan, in the United States. It is located in the northern part of the Lower Peninsula of Michigan, flowing northwest from Rainy Lake to Black Lake. Its waters, after passing through Black Lake, flow via the Black River and the Cheboygan River to Lake Huron.\nQuestion: Where is the river that the engine pumped water from located in the world?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"northeastern Africa\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Little Rock Nine was a group of nine African American students enrolled in Little Rock Central High School in 1957. Their enrollment was followed by the Little Rock Crisis, in which the students were initially prevented from entering the racially segregated school by Orval Faubus, the Governor of Arkansas. They then attended after the intervention of President Dwight D. Eisenhower.\n Paragraph 2: The South African Bank Note Company (SABN) is a South African security printing company responsible for the printing of the South African Rand. It is a wholly owned subsidiary of the South African Reserve Bank.\n Paragraph 3: Mirth & Girth is a portrait painting by School of the Art Institute of Chicago (SAIC) student David K. Nelson, Jr., depicting the recently deceased, popular African-American mayor of Chicago, Harold Washington wearing only a bra, G-string, garter belt and stockings. After a brief showing at a May 11, 1988 private student exhibition in the Art Institute, angry African-American aldermen, including Ald. Allan Streeter, Ald. Bobby Rush and Ald. Dorothy Tillman, arrived with Chicago Police Department officers and confiscated the painting, triggering a First Amendment and race relations crisis and a civil lawsuit.\nQuestion: Who was the first African American student to attend the school that owns Swayze Field?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"James Howard Meredith\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Notes of Love (, , also known as \"The Word Love Exists\" and \"Love Notes\") is a 1998 Italian-French romance film directed by Mimmo Calopresti. For her performance Valeria Bruni Tedeschi won the David di Donatello Award for best actress. The film also won the Nastro d'Argento for best script and the Ciak d'oro for best supporting actress (to Marina Confalone).\n Paragraph 2: \"Mary's Boy Child\" is a 1956 Christmas song, written by Jester Hairston. It is widely performed as a Christmas carol.\n Paragraph 3: Not all reviewers were enthusiastic. Some lamented the use of poor white Southerners, and one-dimensional black victims, and Granville Hicks labeled the book \"melodramatic and contrived\". When the book was first released, Southern writer Flannery O'Connor commented, \"I think for a child's book it does all right. It's interesting that all the folks that are buying it don't know they're reading a child's book. Somebody ought to say what it is.\" Carson McCullers apparently agreed with the Time magazine review, writing to a cousin: \"Well, honey, one thing we know is that she's been poaching on my literary preserves.\"\nQuestion: Who is the child of the Victim of Romance performer?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Chynna Phillips\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Louis Lully (4 August 1664 in Paris – 1 April 1734) was a French musician and the eldest son of Jean-Baptiste Lully.\n Paragraph 2: John II of Jerusalem (1259 or ca. 1267 – 20 May 1285 in Nicosia) was the eldest son of Hugh III of Cyprus and Isabella of Ibelin. He succeeded his father as King of Cyprus (as John I) on March 24 and was crowned at Santa Sophia, Nicosia on May 11, 1284. His succession as King of Jerusalem was opposed by Charles I of Naples, who had also disrupted his father's succession. John died the following year on 20 May, having never married and leaving no children. He was buried in the church of St. Demetrius or according to some Santa Sophia, in Nicosia. According to some authors he was poisoned by his brothers, one of whom, Henry II, succeeded him in Cyprus and Jerusalem. He died unmarried and without issue.\nQuestion: When was John's eldest son crowned?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"1216\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: In many countries, age is reckoned from the date of birth, and sometimes the birthday is celebrated annually. East Asian age reckoning starts newborns at \"1\", incrementing each Lunar New Year.\n Paragraph 2: Pak Nam-gi or Park Nam-ki (21 February 1934 – 17 March 2010) was, until as late as January 2010, Director of the Planning and Finance Department of the ruling party of North Korea. There are doubts about his date of birth, with at least two unattributed sources reporting it as 21 February 1934 or sometime in 1928 respectively.\n Paragraph 3: Ratata was a Swedish pop group fronted by Swedish vocalist Mauro Scocco formed in 1980. It functioned as a 4-piece band until 1983, when it was disbanded. But Johan Ekelund having played with the band briefly continued to cooperate with Scocco continuing as a duo until 1989. The duo had a brief comeback in 2002.\nQuestion: What is the date of birth of the person who was part of Ratata?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"11 September 1962\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The incorporation of the First Amendment establishment clause in the landmark case of Everson v. Board of Education has impacted the subsequent interpretation of the separation of church and state in regard to the state governments. Although upholding the state law in that case, which provided for public busing to private religious schools, the Supreme Court held that the First Amendment establishment clause was fully applicable to the state governments. A more recent case involving the application of this principle against the states was Board of Education of Kiryas Joel Village School District v. Grumet (1994).\n Paragraph 2: Roman Vishniac. Educated at Brooklyn College and Stanford University, he was a professor of biology at the University of Rochester. He died on a research trip to the Antarctic attempting to retrieve equipment in a crevasse. The crater Vishniac on Mars is named in his honor.\n Paragraph 3: Philip Elman (14 March 1918 – 30 November 1999) was an American lawyer at the United States Department of Justice and former member of the Federal Trade Commission. He is best known for writing the government's brief in \"Brown v. Board of Education\".\n Paragraph 4: Ainsworth is a town in Langlade County, Wisconsin, United States. The town, founded in 1904, was named for Thomas Ainsworth, a civil engineer who supervised the construction of the Wolf River Dam in 1869 for the Keshena Improvement Company. The population was 571 at the 2000 Census. The unincorporated community of Pearson is located within the town.\nQuestion: What company is the college where Wolf V. Vishniac studied a part of?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"City University of New York\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Batman (often promoted as Batman: The Movie) is a 1966 American superhero film based on the Batman television series, and the first full - length theatrical adaptation of the DC Comics character Batman. Released by 20th Century Fox, the film starred Adam West as Batman and Burt Ward as Robin. The film hit theaters two months after the last episode of the first season of the television series. The film includes most members of the original TV cast, with the exception of Lee Meriwether as Catwoman, the character previously played by Julie Newmar in two episodes of the series' first season.\n Paragraph 2: Lauren Cohan portrays Martha Wayne in the 2016 film Batman v Superman: Dawn of Justice. During the opening credits, Martha tried to fight the mugger after Thomas gets shot to protect their son only to be killed herself. The mugger's gun gets stuck in her pearl neckalace, and its Recoil damages the necklace. Before dying, her husband yells out her name after seeing her corpse. When Batman and Superman clash due to Lex Luthor's manipulations, Batman spares Superman when Superman asks Batman to ``save Martha ''due to the memories of his own mother and Lois Lane mentioning that Superman's mother is also named Martha.\n Paragraph 3: Mr. Freeze was played by George Sanders, Otto Preminger, and Eli Wallach in the original Batman television series, by Arnold Schwarzenegger in the 1997 film Batman & Robin, and by Nathan Darrow on the TV series Gotham. He was voiced by Michael Ansara in Batman: The Animated Series, by Clancy Brown in The Batman, and by Maurice LaMarche in the Batman: Arkham video game franchise. IGN's list of the Top 100 Comic Book Villains of All Time List ranked Mr. Freeze as # 67.\n Paragraph 4: Pınarhisar is a village in the District of Kozluk, Batman Province, Turkey. As of 2011 it had a population of 527 people.\nQuestion: Who is the spouse of the person who plays Batman in the Lego Batman Movie?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Amy Poehler\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: In an interview with Bill Maher, Jay - Z stated that this song was actually inspired by three different relationships he had in the past, and he wrote about his different experiences all together in different verses.\n Paragraph 2: Beyoncé announced a hiatus from her music career in January 2010, heeding her mother's advice, \"to live life, to be inspired by things again\". During the break she and her father parted ways as business partners. Beyoncé's musical break lasted nine months and saw her visit multiple European cities, the Great Wall of China, the Egyptian pyramids, Australia, English music festivals and various museums and ballet performances.\n Paragraph 3: \"The Trouble with Love Is\" is a song by American singer-songwriter Kelly Clarkson, for her debut studio album \"Thankful\" (2003). The song was written by Clarkson with its producers Evan Rogers and Carl Sturken. It was released as the fourth and final single from the album, being first serviced to US contemporary hit radio on November 12, 2003. \"The Trouble with Love Is\" is an R&B and soul ballad, with elements of gospel music in its chorus. Lyrically, the song finds Clarkson explaining how love can be joyful and sorrowful at the same time. It received mostly positive reviews from music critics, who praised it for being \"soulful\" and \"romantic\", while also praising Clarkson's vocals, comparing them to those of Mariah Carey and Beyoncé.\nQuestion: Who was the person who acquired the parent company of the music service Beyonce owns part of talking about in the song Cry?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"three different relationships he had in the past\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Issues and Answers was a once-weekly TV news program that was telecast by the American Broadcasting Company network from November 1960 to November 1981. The series was distributed to the ABC affiliate stations on Sunday afternoons for either live broadcast or video taped for later broadcast.\n Paragraph 2: Twin of Brothers is a 2004 Hong Kong television series based on the novel of the same Chinese title by Wong Yee. It was broadcast on TVB.\n Paragraph 3: Clive Hale (1937 – 5 June 2005) was an Australian television news and current affairs presenter on the Australian Broadcasting Corporation (ABC) for 38 years.\n Paragraph 4: The show is broadcast live from New York City, on weekdays at 9 a.m. for stations in the Eastern Time Zone, and is tape - delayed for the rest of the country. Although the program is generally associated with the ABC network and airs on all ABC owned - and - operated stations, in many markets the program is syndicated to stations affiliated with other networks. Live did not air in a morning timeslot on all ABC - owned stations until September 2013, as WLS Chicago programmed the 9 a.m. timeslot with The Oprah Winfrey Show as the originating station for the program in the 1980s, then Windy City Live after the end of Oprah, while the New York - based Live had aired on The CW affiliate WGN since 2002 (although WLS had carried the show in an overnight timeslot earlier in its run).\n Paragraph 5: The television industry developed in New York and is a significant employer in the city's economy. The three major American broadcast networks are all headquartered in New York: ABC, CBS, and NBC. Many cable networks are based in the city as well, including MTV, Fox News, HBO, Showtime, Bravo, Food Network, AMC, and Comedy Central. The City of New York operates a public broadcast service, NYCTV, that has produced several original Emmy Award-winning shows covering music and culture in city neighborhoods and city government.\nQuestion: When is Celebrity Big Brother coming to the network which, along with ABC and the network which broadcasted The Chisholms, is the other major broadcaster based in NY?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"February 7, 2018\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Andy Barclay Child's Play character Andy in Child's Play 2 First appearance Child's Play Created by Don Mancini Portrayed by Alex Vincent (1 - 2, 6 - 7) Justin Whalin (3) Information Full name Andrew William Barclay Gender Male Family Karen Barclay (mother) Mr. Barclay (deceased father) Michael Norris (stepfather) Kyle (foster sister) Phil Simpson (deceased foster father) Joanne Simpson (deceased foster mother) Nationality American\n Paragraph 2: Xiao Shuxian (Simplified Chinese: 萧淑娴; Traditional Chinese: 蕭淑嫻; Pinyin: Xiāo Shúxián; sometimes spelled Hsiao Shu-sien) (4 April 1905 in Tianjin – 26 November 1991 in Beijing) was a Chinese composer and music educator.\nQuestion: Who is the other child of Chian Hsiao-chang's father?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Chiang Hsiao-wu\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Bryan Duncan (born March 16, 1953) is an American contemporary Christian music artist. He is known for being lead singer of the group Sweet Comfort Band and subsequent solo career, which spanned more than 25 years. He is currently involved with the Nehosoul Band and \"Radio Rehab\" podcast. He has been the recipient of four Dove Awards and has received multiple Dove and Grammy Award nominations. Notable songs include \"Love You With My Life\", \"Love Takes Time\" and \"A Heart Like Mine\".\n Paragraph 2: Minipops was a television series broadcast in 1983 on Channel 4 in the United Kingdom. Designed primarily for younger viewers, it consisted of music performances on a brightly coloured set featuring preteen children singing then-contemporary pop music hits and older classics. The children were usually made to look like the original performers, including clothing and make-up. Controversy over children singing songs that often contained a subtext of adult content (in adult costumes and make-up) led to the show's cancellation after one series.\n Paragraph 3: \"Just a Fool\" is a duet recorded by American singer songwriters Christina Aguilera and Blake Shelton for Aguilera's seventh studio album, \"Lotus\" (2012). The track was written by Claude Kelly, Wayne Hector, and its producer Steve Robson. \"Just a Fool\" was sent to contemporary hit and hot adult contemporary radio stations in the United States by RCA Records as the second and final single from the album on December 4, 2012. The song is a country pop ballad which discusses the pain of a break-up. It is also Aguilera's first country song.\n Paragraph 4: In 1996, Billboard created a new chart called Adult Top 40, which reflects programming on radio stations that exists somewhere between \"adult contemporary\" music and \"pop\" music. Although they are sometimes mistaken for each other, the Adult Contemporary chart and the Adult Top 40 chart are separate charts, and songs reaching one chart might not reach the other. In addition, hot AC is another subgenre of radio programming that is distinct from the Hot Adult Contemporary Tracks chart as it exists today, despite the apparent similarity in name.\nQuestion: What notable pop artist started out his career on adult contemporary radio along with the performer of Illuminations?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Michael Bubl\\u00e9\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Battle of Graus was a battle of the \"Reconquista\", traditionally said to have taken place on 8 May 1063. Antonio Ubieto Arteta, in his \"Historia de Aragón\", re-dated the battle to 1069. The late twelfth-century \"Chronica naierensis\" dates the encounter to 1070. Either in or as a result of the battle, Ramiro I of Aragon, one of the protagonists, died.\n Paragraph 2: The end of World War II brought a baby boom to many countries, especially Western ones. There is some disagreement as to the precise beginning and ending dates of the post-war baby boom, but it is most often agreed to have begun in the years immediately after the war, though some place it earlier at the increase of births in 1941 - 1943. The boom started to decline as birth rates in the United States started to decline in 1958, though the boom would only grind to a halt 3 years later in 1961, 20 years after it began.\n Paragraph 3: H. Marzuki Alie, Ph.D (Jawi: مرزوقي علي ; born in Palembang, South Sumatera on 6 November 1955) is the speaker of the People's Representative Council, 2009-2014 term, as a member of the Partai Demokrat. Marzuki Alie also served as Secretary General of Partai Demokrat, the party formed by Susilo Bambang Yudhoyono.\nQuestion: On what date did Battle of the birth place of Marzuki Alie end?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"15 February 1942\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: St. Sofroniy Knoll (, ‘Sv. Sofronieva Mogila’ \\ sve-'ti so-'fro-ni-e-va mo-'gi-la\\) is the hill rising to 107 m on the small ice-free peninsula of President Head in the northeast extremity of Snow Island in the South Shetland Islands, Antarctica. Situated 1.3 km southwest of the extreme northeast point of the peninsula.\n Paragraph 2: Mackenzie Peninsula () is a steep, rocky peninsula forming the western end of Laurie Island, in the South Orkney Islands, Antarctica. It was first seen and roughly charted by Captain George Powell and Captain Nathaniel Palmer in 1821. It was surveyed in 1903 by the Scottish National Antarctic Expedition under William S. Bruce, who gave this peninsula the maiden name of his wife, Jessie Mackenzie.\n Paragraph 3: Park Geun - hye (Hangul: 박근혜; Hanja: 朴槿惠; RR: Bak Geun (-) hye; IPA: (pak ‿ k͈ɯn. hje); born 2 February 1952) is a former South Korean politician who served as the 18th President of South Korea from 2013 to 2017. Park was the first woman to be President of South Korea and also the first female president popularly elected as head of state in East Asia. She was also the first South Korean president to be born after the country's founding; her predecessors were either born during Japanese rule or during the post-World War II transitional period.\nQuestion: Who was the first president in the country where the Kamchatka Peninsula is located?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Yeltsin\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Grunwald Swords (, ) were a gift presented by Ulrich von Jungingen, the Grand Master of the Order of Teutonic Knights, to King Władysław II Jagiełło of Poland and Grand Duke Vytautas of Lithuania on 15 July 1410, just before the Battle of Grunwald (Tannenberg). The gift, a pair of simple bare swords, was a formal invitation to the battle. After the Polish-Lithuanian victory, both swords were taken as a war trophy by King Władysław II to Kraków, Poland's capital at the time, and placed in the treasury of the Royal Wawel Castle.\n Paragraph 2: Boy Carrying a Sword is an 1861 oil painting by the French artist Édouard Manet and is now displayed at the Metropolitan Museum of Art in New York. The work depicts a small boy costumed as a page of the Spanish court of the seventeenth century; he is holding a full-sized sword and sword belt. The work was later reproduced as an engraving under the direction of Dijon painter and etcher Alphonse Legros who collaborated in the work.\n Paragraph 3: Emilie de Ravin (/ ˈɛməli də ˈrævɪn /; born 27 December 1981) is an Australian actress. She has played Tess Harding on Roswell and Claire Littleton on the ABC drama Lost. In 2012 she guest - starred as Belle on the ABC drama Once Upon a Time and became a series regular beginning with season two.\nQuestion: Who plays the character that took the sword out of the stone in once upon a time?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Liam Thomas Garrigan\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: 153 25 ``Legs From Here to Homeworld ''Kat Morris (supervising), Liz Artinian (art) Amber Cragg, Hilary Florido and Tom Herpich 2018 (2018) TBA TBD\n Paragraph 2: ``The Dauphin ''is the tenth episode of the second season of the American science fiction television series Star Trek: The Next Generation, the 36th episode overall. It was originally released on February 20, 1989 in broadcast syndication.\n Paragraph 3: Freeway Fighter is a single-player roleplaying gamebook written by Ian Livingstone, illustrated by Kevin Bulmer and originally published in 1985 by Puffin Books. It was later republished by Wizard Books in 2005. It forms part of Steve Jackson and Ian Livingstone's \"Fighting Fantasy\" series. It is the 13th in the series in the original Puffin series () and 23rd in the modern Wizard series ().\n Paragraph 4: \"What Will Happen to the Gang Next Year?\" is the twenty-second and final episode of the sixth season of the American television comedy series \"30 Rock\", and the 125th overall episode of the series. It was directed by Michael Engler, and written by Matt Hubbard. The episode originally aired on the National Broadcasting Company (NBC) network in the United States on May 17, 2012.\nQuestion: When is the next episode of the series that Steven the Sword Fighter is a part of being released?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"TBD\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: John initially adopted a defensive posture similar to that of 1199: avoiding open battle and carefully defending his key castles. John's operations became more chaotic as the campaign progressed, and Philip began to make steady progress in the east. John became aware in July that Arthur's forces were threatening his mother, Eleanor, at Mirebeau Castle. Accompanied by William de Roches, his seneschal in Anjou, he swung his mercenary army rapidly south to protect her. His forces caught Arthur by surprise and captured the entire rebel leadership at the battle of Mirebeau. With his southern flank weakening, Philip was forced to withdraw in the east and turn south himself to contain John's army.\n Paragraph 2: Emilie de Ravin (/ ˈɛməli də ˈrævɪn /; born 27 December 1981) is an Australian actress. She has played Tess Harding on Roswell and Claire Littleton on the ABC drama Lost. In 2012 she guest - starred as Belle on the ABC drama Once Upon a Time and became a series regular beginning with season two.\n Paragraph 3: 13 - year - old orphan Anne Shirley is living in servitude with the cruel Hammond family in Nova Scotia. However, when Mr. Hammond dies, Anne is sent to an orphanage where she eventually receives the wonderful news that she has been adopted by a couple on Prince Edward Island (P.E.I). Upon arriving in P.E.I, Anne is met at the train station by the elderly Matthew Cuthbert who is surprised to find a girl there instead of a boy.\n Paragraph 4: Sebastian Stan (born August 13, 1982) is a Romanian American actor. On television, he has played Carter Baizen in Gossip Girl, Prince Jack Benjamin in Kings, Jefferson in Once Upon a Time, and T.J. Hammond in Political Animals. The latter earned him a nomination for the Critics' Choice Television Award for Best Supporting Actor in a Movie / Miniseries.\nQuestion: Who plays the person with the same name as he who was caught by surprise in Once Upon a Time?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Liam Thomas Garrigan\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Chester Charles Bennington (March 20, 1976 -- July 20, 2017) was an American singer, songwriter, musician, and actor. He served as lead singer for the bands Linkin Park, Dead by Sunrise, Grey Daze, and Stone Temple Pilots. He was widely regarded as one of the top rock vocalists of the 2000s.\n Paragraph 2: Matthew McConaughey (; born November 4, 1969) is an American actor and producer. He first gained notice for his supporting performance in the coming-of-age comedy Dazed and Confused (1993), which is considered by many to be the actor's breakout role . After a number of supporting roles in films including Angels in the Outfield and Texas Chainsaw Massacre: The Next Generation (1994), McConaughey's breakthrough performance as a leading man came in the legal drama A Time to Kill (1996). He followed this with leading performances in the science fiction film Contact and the historical drama Amistad (1997), the comedy-drama The Newton Boys (1998), the satire EDtv (1999), the war drama U-571 (2000) and the psychological thriller Frailty (2001).\n Paragraph 3: Push, Nevada is an American mystery television series set in the fictional town of Push, Nevada. It premiered on September 17, 2002 on ABC, and ran for 7 episodes before it became one of the first shows to be canceled during the Fall 2002 season.\n Paragraph 4: Larry Moffett (November 5, 1954 - May 2, 2011) is an American basketball player who played for Horace Mann High, Gary, Indiana (1973 only), Murray State University (1973–75), Compton Community College (1975–76) and the University of Nevada, Las Vegas (1976–77), before being drafted by the Houston Rockets in the 1977 NBA Draft. However, he played only one NBA season, and appeared in a total of 20 games.\nQuestion: Who was played by the creator of Push, Nevada in Dazed and Confused?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Fred O'Bannion\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Declaration of the Rights of Man and of the Citizen Painting of the Declaration, painted by Jean - Jacques - François Le Barbier Author General Lafayette, (sometimes with Thomas Jefferson) and Honoré Mirabeau. Country Kingdom of France Language French Genre Human rights, declaration and document. Publisher National Constituent Assembly Publication date 27 August 1789\n Paragraph 2: The influence of cubism extended to other artistic fields, outside painting and sculpture. In literature, the written works of Gertrude Stein employ repetition and repetitive phrases as building blocks in both passages and whole chapters. Most of Stein's important works utilize this technique, including the novel The Making of Americans (1906–08). Not only were they the first important patrons of Cubism, Gertrude Stein and her brother Leo were also important influences on Cubism as well. Picasso in turn was an important influence on Stein's writing.\n Paragraph 3: Rights of Man (1791), a book by Thomas Paine, including 31 articles, posits that popular political revolution is permissible when a government does not safeguard the natural rights of its people. Using these points as a base it defends the French Revolution against Edmund Burke's attack in \"Reflections on the Revolution in France\" (1790).\nQuestion: Why was Common Sense, by the same author as Rights of Man, an important work?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"crystallized the rebellious demand for independence from Great Britain\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The American Civil War was fought in the United States from 1861 to 1865. The result of a long - standing controversy over slavery, war broke out in April 1861, when Confederates attacked Fort Sumter in South Carolina, shortly after President Abraham Lincoln was inaugurated. The nationalists of the Union proclaimed loyalty to the U.S. Constitution. They faced secessionists of the Confederate States of America, who advocated for states' rights to expand slavery.\n Paragraph 2: The president was indirectly elected by the people through the Electoral College to a six - year term, and was one of only two nationally elected Confederate officers, the other being the Vice President. On February 18, 1861, Jefferson Davis became president of the provisional government. On February 22, 1862, he became president of the permanent government and served in that capacity until being captured by elements of the United States Cavalry in 1865.\n Paragraph 3: Thornton A. Jenkins (11 December 1811 – 9 August 1893) was an officer in the United States Navy, who served during the Mexican–American War and the American Civil War. He later served as Chief of the Bureau of Navigation and as President of the United States Naval Institute. Jenkins retired as a Rear Admiral.\n Paragraph 4: Jefferson Davis was named provisional president on February 9, 1861, and assumed similar commander - in - chief responsibilities as would Lincoln; on November 6, 1861 Davis was elected President of the Confederate States of America under the Confederate Constitution. Alexander H. Stephens was appointed as Vice President of the Confederate States of America on February 18, 1861, and later assumed identical vice presidential responsibilities as Hannibal Hamlin did. Several men served the Confederacy as Secretary of War, including Leroy Pope Walker, Judah P. Benjamin, George W. Randolph, James Seddon, and John C. Breckinridge. Stephen Mallory was Confederate Secretary of the Navy throughout the conflict.\nQuestion: When did the president of the Confederate States of America end his fight in the Mexican-American war?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"1848\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Sunni Islam is the dominant religion, representing as much as 99% of the population. A minority of the population of the Comoros, mostly immigrants from metropolitan France, are Roman Catholic. Comoros is the only Muslim-majority country in Southern Africa and the second southernmost Muslim-majority territory after the French territory of Mayotte.\n Paragraph 2: San Pietro a Ovile is a medieval Roman Catholic church located in Via del Giglio in Siena, Region of Tuscany, Italy.\n Paragraph 3: The name Vatican city was first used in the Lateran Treaty, signed on 11 February 1929, which established the modern city - state. The name is taken from Vatican Hill, the geographic location of the state. ``Vatican ''is derived from the name of an Etruscan settlement, Vatica or Vaticum meaning garden, located in the general area the Romans called vaticanus ager,`` Vatican territory''.\n Paragraph 4: Sometimes not only church interiors but façades were also decorated with mosaics in Italy like in the case of the St Mark's Basilica in Venice (mainly from the 17th–19th centuries, but the oldest one from 1270–75, \"The burial of St Mark in the first basilica\"), the Cathedral of Orvieto (golden Gothic mosaics from the 14th century, many times redone) and the Basilica di San Frediano in Lucca (huge, striking golden mosaic representing the Ascension of Christ with the apostles below, designed by Berlinghiero Berlinghieri in the 13th century). The Cathedral of Spoleto is also decorated on the upper façade with a huge mosaic portraying the Blessing Christ (signed by one Solsternus from 1207).\nQuestion: When did the location of the basilica named after the same saint at San Pietro in Ciel d'Oro become its own country?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"11 February 1929\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Gladstonian liberalism is a political doctrine named after the British Victorian Prime Minister and leader of the Liberal Party, William Ewart Gladstone. Gladstonian liberalism consisted of limited government expenditure and low taxation whilst making sure government had balanced budgets and the classical liberal stress on self - help and freedom of choice. Gladstonian liberalism also emphasised free trade, little government intervention in the economy and equality of opportunity through institutional reform. It is referred to as laissez - faire or classical liberalism in the United Kingdom and is often compared to Thatcherism.\n Paragraph 2: The current prime minister is Theresa May, who took office on 13 July 2016. She is the leader of the Conservative Party, which won a majority of seats in the House of Commons in the general election on 7 May 2015, when David Cameron was the party leader; although at the last general election she failed to secure a majority government. Prior to this, Cameron and the Conservatives led a coalition from 2010 to 2015 with the Liberal Democrats, in which Cameron was prime minister.\n Paragraph 3: Born in Ameliasburg, Ontario, he was first elected to the House of Commons of Canada as a Liberal Member of Parliament representing the rural Ontario riding of Prince Edward—Hastings in 1988. He was considered a strong supporter of Prime Minister Jean Chrétien, and was removed from the Canadian Cabinet when Paul Martin succeeded Chrétien as Liberal leader and prime minister in 2003.\n Paragraph 4: David Lloyd George, 1st Earl Lloyd-George of Dwyfor, (17 January 1863 – 26 March 1945) was a British statesman and Liberal Party politician. He was the last Liberal to serve as Prime Minister of the United Kingdom.\nQuestion: What event caused the founder of Australia's liberal party to become Prime Minister?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Lyons' death in 1939\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: In 2002, Erna was asked to write and perform a song for the soundtrack to The Scorpion King. The motion picture was the third in the Mummy saga, and was a spin-off prequel of the Mummy series. The song Godsmack wrote and performed was titled \"I Stand Alone\" and the song became the number 1 single at Rock Radio and the most played Active Rock song in 2002 for 14 weeks straight. It was also used in the game Prince of Persia: Warrior Within.\n Paragraph 2: On the show, viewers were asked to send in postcards describing something that they wanted to see on television, such as the reenactment of William Tell shooting an apple off his son's head. (1950 US national archery champion Stan Overby performed the feat, shooting an apple off his assistant's head.)\n Paragraph 3: Ask The Fish is a 1995 (see 1995 in music) live album by Leftover Salmon. It was originally released in 1995, but was reissued once in 1997 by Hollywood Records, and another time in 2001 on Bert Records.\nQuestion: Who is part of the group performing Ask the Fish?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Vince Herman\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Homo Handbook: Getting in Touch with Your Inner Homo: A Survival Guide for Lesbians and Gay Men was published in 1996 by Simon & Schuster's Fireside Books imprint. Written by comedian Judy Carter, the self-help book for the LGBTQ community won the Lambda Literary Award for Best Humor Book at the 9th Lambda Literary Awards. The book is a comedic guidebook that addresses issues such as coming out, dating, and dealing with discrimination.\n Paragraph 2: United Nations Security Council resolution 129, adopted unanimously on August 7, 1958, called an emergency special session of the General Assembly. The resolution states that this was as a result of the lack of unanimity of its permanent members at the council's 834th and 837th meetings which prevented it from exercising its primary responsibility for the maintenance of international peace and security.\n Paragraph 3: Bison antiquus, the ancient or antique bison, is an extinct species of bison that lived in North America until around 10,000 years ago (ya). It was one of the most common large herbivores on the North American continent during the late Pleistocene, and is a direct ancestor of the living American bison.\nQuestion: Which section of the emergency response guidebook of the continent where bison antiquus are found contains the response guides?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"The fourth section, with orange page borders\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: \"Here Come the Girls\" is a song written by Allen Toussaint and originally recorded by Ernie K-Doe and released in 1970. It failed to chart at that time.\n Paragraph 2: The Mother-in-Law Lounge is a live music venue, pub and a shrine in New Orleans, Louisiana dedicated to the memory of rhythm and blues singer, Ernie K-Doe. It is at the downtown river corner of Claiborne Avenue and Columbus Street in the 7th Ward of New Orleans. The exterior of the building is decorated with colorful murals depicting K-Doe and other prominent figures in New Orleans music, especially people who collaborated with K-Doe.\n Paragraph 3: The 2017 Cincinnati mayoral election took place on November 7, 2017, to elect the Mayor of Cincinnati, Ohio. The election was officially nonpartisan, with the top two candidates from the May 2 primary election advancing to the general election, regardless of party. Incumbent Democratic Mayor John Cranley won re-election to a second term.\n Paragraph 4: On January 7, 2012, Beyoncé gave birth to her first child, a daughter, Blue Ivy Carter, at Lenox Hill Hospital in New York. Five months later, she performed for four nights at Revel Atlantic City's Ovation Hall to celebrate the resort's opening, her first performances since giving birth to Blue Ivy.\nQuestion: When did the birthplace of the Here Come the Girls performer elect its first black mayor?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"1970s\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: BLUE, the Wolverine was a live wolverine who served as a team mascot at University of Michigan Wolverines football games and was later kept in a small zoo at the University of Michigan in the 1920s and 1930s. In the mid-1920s, before the acquisition of a live wolverine, the University of Michigan used a mounted and stuffed wolverine, also named ``Biff '', as the team mascot.\n Paragraph 2: Glenn Chadbourne attended Lincoln Academy before continuing his education at The Portland School of Art. He also attended the University of Maine at Augusta, as well as the University of Southern Maine.\n Paragraph 3: William J. Ripple is a Distinguished Professor of Ecology at Oregon State University in the Department of Forest Ecosystems and Society. He is a widely published researcher and a prominent figure in the field of ecology. He is best known for his research on terrestrial trophic cascades, particularly the role of the gray wolf (\"Canis lupus\") in North America as an apex predator and a keystone species that shapes food webs and landscape structures via “top-down” pressures.\n Paragraph 4: The Spirit of Notre Dame is a 1931 American drama film directed by Russell Mack, written by Walter DeLeon, Robert Keith, Richard Schayer and Dale Van Every, and starring Lew Ayres, Sally Blane, William Bakewell, Andy Devine, Harry Barris and J. Farrell MacDonald. It was released on October 13, 1931, by Universal Pictures.\nQuestion: What is the mascot of William J. Ripple's university?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Benny Beaver\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Father Brown, Detective is a 1934 American mystery film directed by Edward Sedgwick and starring Walter Connolly, Paul Lukas and Gertrude Michael. It is based on the Father Brown story \"The Blue Cross\" by G.K. Chesterton, a story which also informed the 1954 film \"Father Brown\" with Alec Guinness and Peter Finch.\n Paragraph 2: Thomas Baring, known as \"Tom\", was the tenth child (fifth of second marriage) of Henry Baring of Cromer Hall, and younger full brother of Edward Baring, 1st Baron Revelstoke. Like his brother, Baring was involved in the family banking business, beginning his career in the Liverpool office of Barings Bank. He later moved to New York City to join Kidder Peabody. When, in 1890, Kidder Peabody split its dual Boston-New York firm, Baring became a partner in the separated New York firm. He and another Kidder-Peabody alumnus, George C. Magoun, formed Baring, Magoun. Both houses continued as North American agents for Barings.\nQuestion: Who is the father of Edward Baring, 1st Baron Revelstoke's father?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Sir Francis Baring, 1st Baronet\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Peter Andreas Hansen (born December 8, 1795, Tønder, Schleswig, Denmark – died March 28, 1874, Gotha, Thuringia, Germany) was a Danish German astronomer.\n Paragraph 2: Johan Ludvig Heiberg (14 December 1791 – 25 August 1860), Danish poet, playwright, literary critic, literary historian son of the political writer Peter Andreas Heiberg (1758–1841), and of the novelist, afterwards the Baroness Gyllembourg-Ehrensvärd, was born in Copenhagen. He promoted Hegelian philosophy and introduced vaudeville to Denmark.\n Paragraph 3: Judi Evans (1964 - 07 - 12) July 12, 1964 (age 53) Montebello, California, U.S. Other names Judi Evans Luciano Occupation Actress Years active 1983 -- present Notable work Beth Raines, Guiding Light Paulina Cory, Another World Adrienne Johnson & Bonnie Lockhart, Days of Our Lives Spouse (s) Michael Luciano (1993 -- present) Children 1 child\nQuestion: Who is the spouse of the child of Peter Andreas Heiberg?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Johanne Luise Heiberg\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Dr. Jesse Bennett (July 10, 1769 -- July 13, 1842) was the first American physician to perform a successful Caesarean section, which he performed on his own wife at the birth of their only child on January 14, 1794.\n Paragraph 2: Falling Out is the debut studio album by Millbrook, Ontario singer Serena Ryder, released in Peterborough, Ontario, Canada in December 1999 by the independent record label Mime Radio.\n Paragraph 3: Mearns Castle is a 15th-century tower house in Newton Mearns, East Renfrewshire, to the south of Glasgow, Scotland. It is a Category A listed building. The castle has been restored and is now part of the Maxwell Mearns Castle Church. It also gives its name to nearby Mearns Castle High School.\n Paragraph 4: The first public military tattoo in Edinburgh was entitled ``Something About a Soldier ''and took place at the Ross Bandstand, Princes Street Gardens, in 1949. The first official Edinburgh Military Tattoo was held in 1950 with eight items in the programme. It drew some 6,000 spectators seated in simple bench and scaffold structures around the north, south, and east sides of the Edinburgh Castle esplanade. In 1952, the capacity of the stands was increased to accommodate a nightly audience of 7,700, allowing 160,000 to watch the multiple live performances.\n Paragraph 5: The GWR 4073 Class 5043 \"Earl of Mount Edgcumbe\" is a steam locomotive of the GWR 'Castle' Class, built in March 1936. It was originally named \"Barbury Castle\", and was renamed \"Earl of Mount Edgcumbe\" in September 1937 (the name coming from the GWR Dukedog Class no 3200/9000). It had a double chimney and 4 row superheater fitted in October 1958.\nQuestion: What is the name of the castle found in the birthplace of the performer of Falling Out?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Casa Loma\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Confederation of Regions Party (CoR) was a right-wing federal political party in Canada founded in 1984 by Elmer Knutson. It was founded as a successor to the Western Canada Federation (West-Fed), a non-partisan organization, to fight the Liberal Party of Canada. The CoR aimed to fill the void on the right of the political spectrum left by the decline of the Social Credit Party of Canada and the growing unpopularity among westerners of the Progressive Conservative Party of Canada under the leadership of Brian Mulroney.\n Paragraph 2: Audrey Marlene McLaughlin (née Brown; born November 8, 1936) was leader of Canada's New Democratic Party (NDP) from 1989 to 1995. She was the first female leader of a political party with representation in the House of Commons of Canada, as well as the first female federal political party leader to represent an electoral district in a Canadian territory.\n Paragraph 3: Benoit was a Conservative Party of Canada Member of Parliament in the House of Commons of Canada, representing the riding of Vegreville—Wainwright from 2004 to 2015, Lakeland from 1997 to 2004 and Vegreville from 1993 to 1997. He has also been a member of the Canadian Alliance (2000-2003) and the Reform Party of Canada (1993-2000). Benoit is a former economist and farmer. As an Opposition MP Benoit was the official opposition critic of Public Works and Government Services and of the Canadian Wheat Board, Intergovernmental Affairs, Citizenship and Immigration, and National Defence.\nQuestion: Who is the federal leader of Leon Benoit's political party?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Andrew Scheer\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Zastava M02 Coyote is a 12.7mm heavy machine gun produced by Zastava Arms. The M02 is very similar to the NSV machine gun and Kord machine gun in appearance and capability. The M02 can fire over 700 rounds per minute and has a maximum effective range of 2,000 m against ground targets and 1,500 m against airborne targets.\n Paragraph 2: Marcia Gay Harden won the Academy Award for Best Supporting Actress for portraying Lee Krasner, Pollock's wife. Ed Harris received an Academy Award nomination for Best Actor for his portrayal of Pollock. The film was a long-term personal project for Harris based on his previous reading of Pollock's biography.Ed Harris’s father had noticed that he resembled Pollock.\n Paragraph 3: The 3-inch gun M1917 was a World War I-era US-made anti-aircraft gun based on the 3-inch gun M1903. It was designed for a fixed mounting and remained in service, primarily at Coast Artillery installations, through World War II. It was determined that the weapon was too heavy and had too much recoil for mobile mountings, so a new weapon based on the lighter and less powerful 3-inch gun M1898 was developed, designated the 3-inch Gun M1918. This was the standard US anti-aircraft gun until replaced by the 3-inch gun M3 in 1930. There is some controversy as to whether any seacoast guns were actually converted into anti-aircraft guns in the development of these weapons.\nQuestion: What gun was used by Pollack's director in Westworld?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"LeMat revolver\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Unstrung Heroes is a 1995 American comedy-drama film directed by Diane Keaton and starring Andie MacDowell, John Turturro, Michael Richards, and Maury Chaykin. The screenplay by Richard LaGravenese is based on the memoir of the same name by journalist Franz Lidz.\n Paragraph 2: Hero and the Terror is a 1988 action film starring martial arts star Chuck Norris, directed by William Tannen. Produced by Menahem Golan, written by Michael Blodgett, and was distributed by Cannon Films. The film stars Norris as Danny O'Brien as a cop trying to stop a serial killer, Simon Moon known as \"The Terror\".\n Paragraph 3: Timeline of release years King's Bounty 1991 Heroes of Might and Magic I Heroes of Might and Magic II Heroes of Might and Magic III Heroes of Might and Magic IV 2003 2005 2006 Heroes of Might and Magic V 2007 2008 2009 2011 Heroes of Might and Magic VI 2012 2013 2014 2015 Heroes of Might and Magic VII\nQuestion: What was the name of the Hero and the Terror star's character in Walker, Texas Ranger?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Cordell Walker\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The large magnitude of solar energy available makes it a highly appealing source of electricity. The United Nations Development Programme in its 2000 World Energy Assessment found that the annual potential of solar energy was 1,575–49,837 exajoules (EJ). This is several times larger than the total world energy consumption, which was 559.8 EJ in 2012.\n Paragraph 2: Some forms of energy (that an object or system can have as a measurable property) Type of energy Description Mechanical the sum of macroscopic translational and rotational kinetic and potential energies Electric potential energy due to or stored in electric fields Magnetic potential energy due to or stored in magnetic fields Gravitational potential energy due to or stored in gravitational fields Chemical potential energy due to chemical bonds Ionization potential energy that binds an electron to its atom or molecule Nuclear potential energy that binds nucleons to form the atomic nucleus (and nuclear reactions) Chromodynamic potential energy that binds quarks to form hadrons Elastic potential energy due to the deformation of a material (or its container) exhibiting a restorative force Mechanical wave kinetic and potential energy in an elastic material due to a propagated deformational wave Sound wave kinetic and potential energy in a fluid due to a sound propagated wave (a particular form of mechanical wave) Radiant potential energy stored in the fields of propagated by electromagnetic radiation, including light Rest potential energy due to an object's rest mass Thermal kinetic energy of the microscopic motion of particles, a form of disordered equivalent of mechanical energy\n Paragraph 3: In 2016 while total world energy came from 80% fossil fuels, 10% biofuels, 5% nuclear and 5% renewable (hydro, wind, solar, geothermal), only 18% of that total world energy was in the form of electricity. Most of the other 82% was used for heat and transportation.\n Paragraph 4: OnForce Solar is an American company that sells and installs solar energy packages for commercial customers. It was founded in 2007.\nQuestion: When was the celestial body that transforms nuclear potential energy to other forms of energy discovered to be the center of the solar system?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"as early as the 3rd century BC\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Forest Warrior is a 1996 American adventure film starring Chuck Norris and directed by Norris's brother Aaron Norris. The film was released on direct-to-video in the United States on November 5, 1996. The film is perhaps best known since late 2011 as the source of a scene in which Chuck (a ubiquitous Internet meme himself) stops a chainsaw by grabbing it with his bare hand. The scene has been reposted numerous times on YouTube with views totaling several million, as well as made into an animated GIF for use on Internet forums and message boards. (Another memorable scene features a logger who air guitars with his chainsaw.)\n Paragraph 2: Berdan is a former settlement in Butte County, California, United States. It was located north of Forest Ranch, between Forest Ranch and Westbranch. A post office operated in Berdan from 1909 to 1916. The town was named for Myron G. Berdan, its first postmaster. Berdan's economy was based on being a trading center for miners working the nearby mines.\n Paragraph 3: \"The Warrior and the Sorceress\" was the second entry in a series of ten films that Roger Corman produced in Argentina during the 1980s; the first one being \"Deathstalker\".\n Paragraph 4: Golden State Warriors 2017 -- 18 Golden State Warriors season Conference Western Division Pacific Founded 1946 History Philadelphia Warriors 1946 -- 1962 San Francisco Warriors 1962 -- 1971 Golden State Warriors 1971 -- present Arena Oracle Arena Location Oakland, California Team colors Royal blue, California golden yellow, slate Main sponsor Rakuten President Rick Welts General manager Bob Myers Head coach Steve Kerr Ownership Joe Lacob (majority), Peter Guber Affiliation (s) Santa Cruz Warriors Championships 5 (1947, 1956, 1975, 2015, 2017) Conference titles 9 Eastern: 3 (1947, 1948, 1956) Western: 6 (1964, 1967, 1975, 2015, 2016, 2017) Division titles 6 (1975, 1976, 2015, 2016, 2017, 2018) Retired numbers 6 (13, 14, 16, 17, 24, 42) Website www.nba.com/warriors Uniforms Home Away\nQuestion: what was the name of the producer of Forest Warrior walker texas ranger?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Cordell Walker\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Kichi Sipi Bridge spans a deep channel of the Nelson River south of Cross Lake, providing the only all-weather road link between eastern Manitoba and the rest of Canada and North America. Its origins are unusual and its technology innovative. At 850 feet, it is the second longest road bridge in Manitoba.\n Paragraph 2: Old (16th Avenue) Bailey Bridge was a bailey bridge located on 16th Avenue (York Regional Road 73) east of Reesor Road within Rouge Park in Markham, Ontario, Canada. The bridge crossed the Little Rouge Creek, a tributary of the Rouge River.\n Paragraph 3: Gaskins Run is a tributary of the Susquehanna River in Montour County and Northumberland County, in Pennsylvania, in the United States. It is approximately long and flows through Liberty Township, Montour County, Mahoning Township, Montour County. The watershed of the stream has an area of . At least one bridge crosses the stream. It is considered to be both a Coldwater Fishery and a Migratory Fishery.\nQuestion: Of which river is the river Kichi Sipi Bridge crosses a tributary?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Hudson's Bay\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Edward Wesley Schulmerich (August 21, 1901 – June 26, 1985) was an American Major League Baseball player from the state of Oregon. A native of the state, he played baseball and football at what is now Oregon State University where he participated in three sports. On the football team, he played three positions and earned the nickname of Ironhorse and all-conference honors. In baseball, he was a right-handed outfielder and after leaving school started his professional career in the minor leagues. Schulmerich then became the first player from the school to make it to the Major Leagues, playing for three teams in the early 1930s. He is a member of the Oregon State University Sports Hall of Fame and the Oregon Sports Hall of Fame.\n Paragraph 2: The Bennigsen Beavers were established in 1993 as a department of FC Bennigsen, and became an independent sporting team on January 1, 2004. The club fielded 7 teams for the 2005 season, including three men's teams, a women's team, a junior team, a youth team and a student team. As of mid-2005, the Beavers claimed a total of 97 Members.\n Paragraph 3: Anna Benson (born February 12, 1976) is an American model, former stripper, and ex-wife of former Major League Baseball pitcher Kris Benson.\nQuestion: What team was Anna Benson's husband on?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Pittsburgh Pirates\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Tiffany Stiegler (born January 14, 1984) is an American figure skater who competed in both pair skating and ice dancing. Competing in pairs with her brother Johnnie Stiegler, she won the bronze medal at the 1998 Sparkassen Cup on Ice and placed fourth at the 1999 World Junior Championships.\n Paragraph 2: ``Moon River ''is a song composed by Henry Mancini with lyrics by Johnny Mercer. It was originally performed by Audrey Hepburn in the 1961 movie Breakfast at Tiffany's, winning an Academy Award for Best Original Song. The song also won the 1962 Grammy Awards for Record of the Year and Song of the Year.\nQuestion: For what did the singer of Moon River in Breakfast at Tiffany's win a Tony?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"for Best Performance by a Leading Actress in a Play in Ondine\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: In September 1880 a landslide ('the landslip of 1880') occurred at the north end of the town, burying 151 people. The first known landslide had occurred in 1866, and in 1879 there was a larger one at the same spot, Alma Hill, but ``the great slip occurred in the following year, on Saturday 18 September 1880. ''\n Paragraph 2: Ptolemy (295–272 BC) was the oldest son of king Pyrrhus of Epirus and his first wife Antigone, who probably died in childbirth. He was named in honour of his mother's stepfather, king Ptolemy I Soter of Egypt, who was a benefactor to Pyrrhus in his youth.\n Paragraph 3: The Seven Years' War was fought between 1755 and 1764, the main conflict occurring in the seven-year period from 1756 to 1763. It involved every great power of the time except the Ottoman Empire, and affected Europe, the Americas, West Africa, India, and the Philippines. Considered a prelude to the two world wars and the greatest European war since the Thirty Years War of the 17th century, it once again split Europe into two coalitions, led by Great Britain on one side and France on the other. For the first time, aiming to curtail Britain and Prussia's ever-growing might, France formed a grand coalition of its own, which ended with failure as Britain rose as the world's predominant power, altering the European balance of power.\nQuestion: Which years did the war with Antigone's spouse occur?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"323\\u2013272 BC\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: James Stokes Millner MD (1830 – 25 February 1875) was a medical practitioner and administrator in the early history of the Northern Territory of Australia.\n Paragraph 2: Helvetia is a populated place in Pima County, Arizona, that was settled in 1891 and abandoned in the early 1920s. Helvetia is an ancient name for Switzerland.\n Paragraph 3: Territories of the United States are sub-national administrative divisions directly overseen by the United States Federal Government. Unlike U.S. states and Native American tribes which exercise limited sovereignty alongside the federal government, territories are without sovereignty. The territories are classified by whether they are incorporated and whether they have an ``organized ''government through an Organic Act passed by the U.S. Congress.\n Paragraph 4: Pima County Natural Resources, Parks and Recreation is the agency within Pima County, Arizona that manages the natural resources, parks, and recreation offerings within Pima County including Tucson, AZ.\n Paragraph 5: Pettai is a panchayat village and revenue village in Pondicherry Union Territory, India. Administratively, Pettai is under the Thirunallar Taluk (formerly Thirunallar Commune Panchayat) of Karaikal District, Pondicherry Union Territory. Pettai is situated on the banks of the Arasalar River, to the west of Karaikal town and south of Thirunallar.\nQuestion: What was the wettest year of the city located in the county that also contains Helvetia?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"1905\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: In the Bible, Meshech or Mosoch ( \"Mešeḵ\" \"price\" or \"precious\") is named as a son of Japheth in Genesis 10:2 and 1 Chronicles 1:5.\n Paragraph 2: To compete with the popular Family Computer in Japan, NEC Home Electronics launched the PC Engine in 1987, and Sega Enterprises followed suit with the Mega Drive in 1988. The two platforms were later launched in North America in 1989 as the TurboGrafx-16 and the Genesis respectively. Both systems were built on 16-bit architectures and offered improved graphics and sound over the 8-bit NES. However, it took several years for Sega's system to become successful. Nintendo executives were in no rush to design a new system, but they reconsidered when they began to see their dominance in the market slipping.\n Paragraph 3: The Creation () is an oratorio written between 1797 and 1798 by Joseph Haydn (Hob. XXI:2), and considered by many to be one of his masterpieces. The oratorio depicts and celebrates the creation of the world as described in the Book of Genesis.\nQuestion: What were the Genesis's advantages over the platform that plays Sunman?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"built on 16-bit architectures and offered improved graphics and sound\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Sony's PlayStation 3 has extensive HD compatibility because of its built in Blu-ray disc based player, so does Microsoft's Xbox 360 with the addition of Netflix and Windows Media Center HTPC streaming capabilities, and the Zune marketplace where users can rent or purchase digital HD content. Recently, Nintendo released a next generation high definition gaming platform, The Wii U, which includes TV remote control features in addition to IPTV streaming features like Netflix. The HD capabilities of the consoles has influenced some developers to port games from past consoles onto the PS3, Xbox 360 and Wii U, often with remastered or upscaled graphics.\n Paragraph 2: Chick Chick Boom is an online Adobe Flash game created for Easter 2007 by German developer Extra Toxic and sponsored by Nintendo of Europe. (The two companies had previously cooperated in a similar project called \"\".) The game launched on April 3, 2007 and was only playable through the month of April. After the extra Toxic disabled play on April 30, 2007, a new version of the game, presenting new features and 3D visuals, was released on Q4 2010 for the Wii as a downloadable game for the WiiWare service.\n Paragraph 3: Cellius (株式会社セリウス \"Kabushiki-Gaisha Seriusu\"), located in Shibuya, Tokyo, was a computer game developer founded in 2007 as a venture between Sony and Bandai Namco Holdings. The aim of the company is to \"help take share from Microsoft Corp. and Nintendo Co.\" Sony hopes that the company will make up for the losses it made during quarter two of its financial year. 'Father of the PlayStation' Ken Kutaragi was announced as CEO.\n Paragraph 4: On May 26, 2009, Microsoft announced the future release of the Zune HD (in the fall of 2009), the next addition to the Zune product range. This is of an impact on the Xbox Live Video Store as it was also announced that the Zune Video Marketplace and the Xbox Live Video Store will be merged to form the Zune Marketplace, which will be arriving on Xbox Live in 7 countries initially, the United Kingdom, the United States, France, Italy, Germany, Ireland and Spain. Further details were released at the Microsoft press conference at E3 2009.\nQuestion: Which two features were played up the Microsoft executive who announced IPTV in 2007?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"ease of use and enhanced support for Plug and Play\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: By the end of the 5th century the western section of the empire was divided into smaller political units, ruled by the tribes that had invaded in the early part of the century. The deposition of the last emperor of the west, Romulus Augustus, in 476 has traditionally marked the end of the Western Roman Empire.[E] The Eastern Roman Empire, often referred to as the Byzantine Empire after the fall of its western counterpart, had little ability to assert control over the lost western territories. The Byzantine emperors maintained a claim over the territory, but none of the new kings in the west dared to elevate himself to the position of emperor of the west, Byzantine control of most of the Western Empire could not be sustained; the reconquest of the Italian peninsula and Mediterranean periphery by Justinian (r. 527–565) was the sole, and temporary, exception.\n Paragraph 2: According to a 2011 Pew Research Center survey, there were 2.2 billion Christians around the world in 2010, up from about 600 million in 1910. By 2050, the Christian population is expected to exceed 3 billion. According to a 2012 Pew Research Center survey Christianity will remain the world's largest religion in 2050, if current trends continue.\n Paragraph 3: According to Pew Research, 7% of the population identifies as Christian; 4% as Muslim; 1% follows traditional animistic beliefs; and 2% follow other religions, including Mahayana Buddhism, Hinduism, and East Asian religions. However, according to a US State Department's 2010 international religious freedom report, official statistics are alleged to underestimate the non-Buddhist population. Independent researchers put the Muslim population at 6 to 10% of the population[citation needed]. Jehovah's Witnesses have been present since 1914 and have about 80 congregations around the country and a branch office in Yangon publishing in 16 languages. A tiny Jewish community in Rangoon had a synagogue but no resident rabbi to conduct services.\n Paragraph 4: According to an April 2011 report by the Pew Center on the States, the average national recidivism rate for released prisoners is 43%.\nQuestion: According to Pew in 2010, what percent of Nigeria's population was the people who conquered the Eastern provinces of the Byzantine empire?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"48.8 percent\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Dance is the fifth studio album by saxophone player Dave Koz. It was released by Capitol Records on September 28, 1999. The album peaked at number 2 on Billboard Top Contemporary Jazz Albums chart. The album has been sold more than 500,000 copies and was certified Gold by the Recording Industry Association of America (RIAA).\n Paragraph 2: Danzón (Dance On) is an album by Arturo Sandoval, released through GRP Records in 1994. In 1995, the award won Sandoval the Grammy Award for Best Latin Jazz Performance and the Billboard Latin Music Award for Latin Jazz Album of the Year.\n Paragraph 3: 2 Horns / 2 Rhythm is an album by American jazz trumpeter Kenny Dorham featuring performances with Ernie Henry recorded in 1957 and released on the Riverside label. This was Henry's last recording session.\n Paragraph 4: Easterly Winds is an album by American jazz pianist Jack Wilson featuring performances recorded and released on the Blue Note label in 1967.\nQuestion: What artist was featured on Smooth Jazz Stations, along with Kenny G and the performer of The Dance?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"George Benson\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Vilnius County () is the largest of the 10 counties of Lithuania, located in the east of the country around the city Vilnius. On 1 July 2010, the county administration was abolished, and since that date, Vilnius County remains as the territorial and statistical unit.\n Paragraph 2: When the Batavian Republic was created in 1795, the Lordship of Frisia was abolished as a relic of the Ancien Régime.\n Paragraph 3: The Oath of Citizenship or officially Oath of Allegiance, is a statement recited by individuals wishing to become citizens of the Republic of Trinidad and Tobago. Individuals who wish to become a citizen of Trinidad and Tobago do so through the Ministry of National Security's Citizenship and Immigration Section. The Oath of Allegiance is a mandatory step to becoming a citizen of Trinidad and Tobago.\nQuestion: When was the country Merewalh was a citizen of abolished?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"918\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Dead Horse Bay is a small water body off Barren Island, between the Gerritsen Inlet and Rockaway Inlet in the New York City borough of Brooklyn.\n Paragraph 2: There is a small island off its northwestern point called Hall Island. The wide sound between both islands is called Sarichef Strait. A small rocky islet called Pinnacle Rock lies to the south of Saint Matthew Island. The entire island's natural scenery and wildlife is protected as it is part of the Bering Sea unit of the Alaska Maritime National Wildlife Refuge.\n Paragraph 3: The Sea of Sardinia is a body of water in the Mediterranean Sea between the Spanish archipelago of Balearic Islands and the Italian island of Sardinia.\n Paragraph 4: Pine Island is an island of Northern Ontario, Canada, in the northwestern portion of Lake Huron, near the mouth of the St. Marys River, which connects Lake Huron with Lake Superior. It has a mix of year-round and seasonal (cottage) residents. Some of them live near the island; and some of those neighbors live on other smaller islands nearby. During the night, a nearby lighthouse blinks with an interval of approximately 3 seconds. The lighthouse is located on Matthew's Island, used seasonally by the Matthew's family. This island is geographically close to St. Joseph Island.\nQuestion: What is the body of water that St. Matthew Island located in named after?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Vitus Bering\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: In 1929, Lionel Robbins assumed the helm of the London School of Economics (LSE). Eager to promote alternatives to what he regarded as the narrow approach of the school of economic thought that then dominated the English-speaking academic world (centred at the University of Cambridge and deriving largely from the work of Alfred Marshall), Robbins invited Hayek to join the faculty at LSE, which he did in 1931. According to Nicholas Kaldor, Hayek's theory of the time-structure of capital and of the business cycle initially \"fascinated the academic world\" and appeared to offer a less \"facile and superficial\" understanding of macroeconomics than the Cambridge school's.\n Paragraph 2: Also in 1931, Hayek critiqued Keynes's Treatise on Money (1930) in his \"Reflections on the pure theory of Mr. J. M. Keynes\" and published his lectures at the LSE in book form as Prices and Production. Unemployment and idle resources are, for Keynes, caused by a lack of effective demand; for Hayek, they stem from a previous, unsustainable episode of easy money and artificially low interest rates. Keynes asked his friend Piero Sraffa to respond. Sraffa elaborated on the effect of inflation-induced \"forced savings\" on the capital sector and about the definition of a \"natural\" interest rate in a growing economy. Others who responded negatively to Hayek's work on the business cycle included John Hicks, Frank Knight, and Gunnar Myrdal. Kaldor later wrote that Hayek's Prices and Production had produced \"a remarkable crop of critics\" and that the total number of pages in British and American journals dedicated to the resulting debate \"could rarely have been equalled in the economic controversies of the past.\"\nQuestion: Who did Hay work for after being hired by his other notable influence regarding resource distribution other than Max Weber?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"the Austrian government\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Chief of Naval Research is the senior military officer in charge of scientific research in the United States Navy. The Chief of Naval Research has a rank of Rear Admiral, and is in charge of the Office of Naval Research.\n Paragraph 2: This is a list of toll roads in the United States (and its territories). Included are current and future high-occupancy toll (HOT) lanes, express toll (ETL) lanes, and hybrid systems. HOV, as used in this article, is high occupancy vehicle.\n Paragraph 3: Calderón (pronounced (kaldeˈɾon)) is a Spanish occupational surname. It is derived from the Vulgar Latin ``caldaria ''(`` cauldron'') and refers to the occupation of tinker.\n Paragraph 4: Through combining the definition of electric current as the time rate of change of electric charge, a rule of vector multiplication called Lorentz's Law describes the force on a charge moving in a magnetic field. The connection between electricity and magnetism allows for the description of a unified electromagnetic force that acts on a charge. This force can be written as a sum of the electrostatic force (due to the electric field) and the magnetic force (due to the magnetic field). Fully stated, this is the law:\nQuestion: Who was in charge of the area where Pavilion Welgelegen is located?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Johan Remkes\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Brandon Vick is an American politician of the Republican Party. He is a member of the Washington House of Representatives, representing the 18th district, first elected to that position in 2012. He first ran for office against Ann Rivers for the seat in 2010, but lost. He once served as chairman of The Clark County Republican Party.\n Paragraph 2: Marple was born in Melbourne and educated at Brighton, becoming a primary teacher specialising in helping children with learning difficulties. A member of the Australian Labor Party, she ran as a candidate for several federal elections, contesting the safe Coalition seat of Indi in 1980 and 1983 and running in the unwinnable fourth position on the Victorian Labor Senate ticket in 1984 and 1990. From 1987–90 she was chairperson of the party's Rural Policy Committee, and chairperson of the Conservation Policy Committee 1986–92.\n Paragraph 3: A farmer, he first ran for the House of Commons of Canada in an 1880 by-election for the riding of Brome. Although defeated, he was elected in 1882 and 1887. A Liberal, he lost to the Conservative candidate Eugène Alphonse Dyer by 3 votes in the 1891 election. He was elected again in the 1896 election and was re-elected in 1900, 1904, and 1908. He was defeated in 1911 and in a 1913 by-election. From 1896 to 1911, he was the Minister of Agriculture.\n Paragraph 4: The One Hundred Fifteenth United States Congress is the current meeting of the legislative branch of the United States federal government, composed of the Senate and the House of Representatives. It meets in Washington, D.C. from January 3, 2017, to January 3, 2019, during the final weeks of Barack Obama's presidency and the first two years of Donald Trump's presidency. The November 2016 elections maintained Republican control of both the House and Senate.\nQuestion: Where was Obama's opponent in his first election educated?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"National War College\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Broadway's Like That (1929) is a 10-minute Vitaphone short film starring Ruth Etting, with Joan Blondell, Humphrey Bogart and Mary Philips. Bogart and Philips were married at the time of this film.\n Paragraph 2: Wells Fargo Gunmaster is a 1951 American western film directed by Philip Ford and starring Allan Lane, Mary Ellen Kay and Chubby Johnson.\n Paragraph 3: The winners were announced during the awards ceremony on February 26, 2012. The Artist was the second silent feature to win Best Picture. The 1927 film Wings was the first such film to achieve this distinction at the inaugural awards ceremony in 1929. Moreover, it was also the first black - and - white feature to win Best Picture since 1993's Schindler's List. Best Actor winner Jean Dujardin became the first French actor to win an Oscar. With her latest win for Best Actress, Meryl Streep became the fifth performer to win at least three acting Oscars. At age 82, Best Supporting Actor winner Christopher Plummer also made Oscar history by becoming the oldest ever performer to win a competitive acting Oscar.\nQuestion: with what movie did Mary Philips' husband win his only oscar?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"The African Queen\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The following is a list of the 20 golfers who have risen to the top of the Official World Golf Ranking. As of October 22, 2017, Dustin Johnson is the number one ranked golfer. Tiger Woods has spent the most consecutive weeks (281) and most total weeks (683) in that position. Three golfers have spent an entire calendar year atop the rankings: Nick Faldo (1993), Greg Norman (1996), and Woods (2000, 2001, 2002, 2003, 2006, 2007, 2008, 2009).\n Paragraph 2: Miami is a major center, and a leader in finance, commerce, culture, media, entertainment, the arts, and international trade. In 2012, Miami was classified as an Alpha−World City in the World Cities Study Group's inventory. In 2010, Miami ranked seventh in the United States in terms of finance, commerce, culture, entertainment, fashion, education, and other sectors. It ranked 33rd among global cities. In 2008, Forbes magazine ranked Miami \"America's Cleanest City\", for its year-round good air quality, vast green spaces, clean drinking water, clean streets, and city-wide recycling programs. According to a 2009 UBS study of 73 world cities, Miami was ranked as the richest city in the United States, and the world's fifth-richest city in terms of purchasing power. Miami is nicknamed the \"Capital of Latin America\", is the second largest U.S. city with a Spanish-speaking majority, and the largest city with a Cuban-American plurality.\n Paragraph 3: Allan Stone (born 14 October 1945) played amateur and professional tennis in the 1960s and 1970s. He was ranked as high as World No. 38 in singles on the ATP Rankings in April 1975.\n Paragraph 4: The following is a list of golfers who have been top of the Official World Golf Ranking. As of June 17, 2018, Dustin Johnson is the number one ranked golfer. Tiger Woods has spent the most consecutive weeks (281) and most total weeks (683) in that position. Three golfers have spent an entire calendar year atop the rankings: Nick Faldo (1993), Greg Norman (1996), and Woods (2000, 2001, 2002, 2003, 2006, 2007, 2008, 2009).\nQuestion: According to QS World University Rankings, what is the ranking of the place that employed Said Ashour?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"551-600\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Market strategist Phil Dow believes distinctions exist \"between the current market malaise\" and the Great Depression. He says the Dow Jones average's fall of more than 50% over a period of 17 months is similar to a 54.7% fall in the Great Depression, followed by a total drop of 89% over the following 16 months. \"It's very troubling if you have a mirror image,\" said Dow. Floyd Norris, the chief financial correspondent of The New York Times, wrote in a blog entry in March 2009 that the decline has not been a mirror image of the Great Depression, explaining that although the decline amounts were nearly the same at the time, the rates of decline had started much faster in 2007, and that the past year had only ranked eighth among the worst recorded years of percentage drops in the Dow. The past two years ranked third, however.\n Paragraph 2: German chocolate cake, originally German's chocolate cake, is a layered chocolate cake from the United States filled and topped with a coconut - pecan frosting. It owes its name to an English - American chocolate maker named Samuel German, who developed a formulation of dark baking chocolate that came to be used in the cake recipe. Sweet baking chocolate is traditionally used for the chocolate flavor in the actual cake, but few recipes call for it today. The filling and / or topping is a custard made with egg yolks and evaporated milk; once the custard is cooked, coconut and pecans are stirred in. Occasionally, a chocolate frosting is spread on the sides of the cake and piped around the circumference of the layers to hold in the filling. Maraschino cherries are occasionally added as a garnish.\n Paragraph 3: Lorenzo Zambrano was the chairman and chief executive officer until his death on May 21, 2014. About one-third of the company's sales come from its Mexico operations, a quarter from its plants in the U.S., 15% from Spain, and smaller percentages from its plants around the world.\nQuestion: What was the percentage the Dow Jones fell during the time the first cake mix come out?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"54.7%\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The coastline is inhabited by marine mammals, like sea lions, elephant seals and fur seals. Southern right whales can be found in Golfo Nuevo and Golfo San José, protected bodies of water located between the peninsula and the Patagonian mainland. These baleen whales come here between May and December, for mating and giving birth, because the water in the gulf is quieter and warmer than in the open sea. Orcas can be found off the coast, in the open sea off the peninsula. In this area, they are known to beach themselves on shore to capture sea lions and elephant seals.\n Paragraph 2: Seals was drafted in the first round by the Utah Stars, playing two seasons in the ABA before being drafted into the NBA in the second round by the Seattle SuperSonics in 1975. Seals played three seasons in the NBA.\n Paragraph 3: The Seal River is a river in the Northern Region of Manitoba, Canada. It travels from Shethanei Lake to the Hudson Bay. The river was nominated for the Canadian Heritage Rivers System in 1987 and was officially listed in 1992.\n Paragraph 4: USS \"Acme\" (MSO-508) was an acquired by the United States Navy for the task of removing mines that had been placed in the water to prevent the safe passage of ships.\nQuestion: What does seal stand for in the operator of the list of destroyer classes of the operator of the USS Acme seals?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Sea, Air, and Land\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Piama Tananahaakna, played by Emy Coligado (29 episodes), is Francis' wife whom he met and married off - screen during his year in Alaska. Piama is about a year older than Francis, and before him, Piama had previously been married briefly. Primarily due to her being brought home under volatile circumstances, in which Francis (while still a minor, although emancipated) shocked the family with news of the marriage and thus disrupting Hal's birthday party, Lois disliked Piama from her introduction in the third season and into the fourth. However, after an embarrassing encounter with her wealthy in - law's, Lois has been much more respectful of Piama. She originally started off against having children, but by Graduation, Piama got over it after Reese's prank went awry (``We may as well go ahead and have kids now, I'm not afraid of changing diapers any more. '')\n Paragraph 2: When the Emancipation Proclamation was announced, Tennessee was mostly held by Union forces. Thus, Tennessee was not among the states enumerated in the Proclamation, and the Proclamation did not free any slaves there. Nonetheless, enslaved African Americans escaped to Union lines to gain freedom without waiting for official action. Old and young, men, women and children camped near Union troops. Thousands of former slaves ended up fighting on the Union side, nearly 200,000 in total across the South.\n Paragraph 3: Although the importation of slaves to St Helena had been banned in 1792, the phased emancipation of over 800 resident slaves did not take place until 1827, which was still some six years before the British Parliament passed legislation to ban slavery in the colonies.\nQuestion: Over how many slaves ended up getting emancipated on the birth place of Francis Watson?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"800\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: \"Seether\" is a single by American alternative rock band Veruca Salt. It was backed with \"All Hail Me\". In 1994, the song was No. 3 in British Radio One DJ John Peel's \"Festive Fifty\". The song appeared in the film \"Young Adult\" and the TV shows \"Hindsight\" and \"Halt and Catch Fire\".\n Paragraph 2: Charlie and the Chocolate Factory is a 2005 musical fantasy comedy film directed by Tim Burton and written by John August, based on the 1964 British novel of the same name by Roald Dahl. The film stars Johnny Depp as Willy Wonka and Freddie Highmore as Charlie Bucket. The storyline follows Charlie, who wins a contest and, along with four other contest winners, is led by Wonka on a tour of his chocolate factory, the most magnificent in the world.\n Paragraph 3: Veruca Salt is a greedy, demanding, manipulative and stingy brat. She demands every single thing she wants (and more), the second person to find a Golden Ticket, the third eliminated from the tour. A selfish, rotten brat who shows her wealthy family no mercy and has absolutely no regard for other people's property, Veruca frequently pesters her parents to purchase a variety of different objects for her. In the 2005 film, it is revealed that she owns a pony, two dogs, four cats, six rabbits, two parakeets, three canaries, a parrot, a turtle, and a hamster, totalling up to 21 pets. But when she interferes with the trained squirrels used by Willy Wonka to select the best nuts to bake into chocolate bars, she is judged as a ``bad nut ''by the squirrels and discarded into the adjacent 'garbage chute' and her parents follow. All three are later seen leaving the factory`` covered in garbage''. Her nationality was never specified in Dahl's novel, but she hails from an upper - class family in the United Kingdom in both films.\nQuestion: Who played Seether's performer in willy wonka and the chocolate factory?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Julie Dawn Cole\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Basketball at the 1936 Summer Olympics was the first appearance of the sport as an official medal event. The tournament was played between 7 August and 14 August 1936 in Berlin, Germany. 21 nations entered the competition, making basketball the largest tournament of the team sports.\n Paragraph 2: In 1989, Miranda joined the Tucson Amigos for the 1989–90 Southwest Independent Soccer League. He earned Rookie of the Year honors with the Amigos. Miranda graduated from Sunnyside High School. In 1990, Miranda entered Yavapai College where he was a member of the 1990 National Junior College Champions and 1991 National Junior College Runner-Up men’s soccer teams. He then transferred to Sangamon State for the 1992 and 1993 seasons. In 1993, Sangamon State won the NAIA national men's soccer championship. In 1996, Miranda played for the New Mexico Chiles in the USISL Select League. In 1997, he moved to the Arizona Sahuaros of the USISL D-3 Pro League. He broke his leg during the season. This led to his taking the boy’s head coaching position at Sunnyside High School. He returned to playing in 2000 with the Tucson Fireballs. In 2009, Miranda became an assistant coach of the women’s team at Pima Community College.\nQuestion: In what league did Jose Miranda's team compete?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"United Soccer League\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Territories of the United States are sub-national administrative divisions directly overseen by the United States Federal Government. Unlike U.S. states and Native American tribes which exercise limited sovereignty alongside the federal government, territories are without sovereignty. The territories are classified by whether they are incorporated and whether they have an ``organized ''government through an Organic Act passed by the U.S. Congress.\n Paragraph 2: Ye Rongguang (; born October 3, 1963 in Wenzhou, Zhejiang) is a retired Chinese chess Grandmaster, who in 1990, became the first ever Chinese player to gain the Grandmaster title. He was for more than ten years the coach of women's world chess champion Zhu Chen. He lives in the Netherlands, and was appointed Vice-Chairman of the Netherlands Chinese Photographic Society.\nQuestion: What county was Ye Rongguang born in?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Yongjia County\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Leader of the Liberal Democrats Incumbent Vince Cable since 20 July 2017 Member of Lib Dem. frontbench team Lib Dem. Federal Board Appointer Liberal Democrats membership Inaugural holder David Steel and Bob Maclennan Formation 3 March 1988 Website Official website\n Paragraph 2: James Stephen Rice (1846–1939) was an American businessman and rancher who was a pioneering resident of Orange County, California and a civic leader in Tustin, California.\n Paragraph 3: List of members of the Californian United States House delegation, their terms in office, district boundaries, and the district political ratings according to the CPVI. The delegation has 53 members, with 39 Democrats and 14 Republicans, including both the Republican majority leader, Kevin McCarthy, and the Democratic minority leader, Nancy Pelosi.\n Paragraph 4: The Federal Constitution adopted in 1848 is the legal foundation of the modern federal state. It is among the oldest constitutions in the world. A new Constitution was adopted in 1999, but did not introduce notable changes to the federal structure. It outlines basic and political rights of individuals and citizen participation in public affairs, divides the powers between the Confederation and the cantons and defines federal jurisdiction and authority. There are three main governing bodies on the federal level: the bicameral parliament (legislative), the Federal Council (executive) and the Federal Court (judicial).\nQuestion: Who is the federal leader of the party that James Rajotte is a member of?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Andrew Scheer\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The essential nature of the atomic nucleus was established with the discovery of the neutron by James Chadwick in 1932 and the determination that it was a new elementary particle, distinct from the proton.\n Paragraph 2: The neutron detection temperature, also called the neutron energy, indicates a free neutron's kinetic energy, usually given in electron volts. The term temperature is used, since hot, thermal and cold neutrons are moderated in a medium with a certain temperature. The neutron energy distribution is then adapted to the Maxwellian distribution known for thermal motion. Qualitatively, the higher the temperature, the higher the kinetic energy of the free neutrons. The momentum and wavelength of the neutron are related through the de Broglie relation. The large wavelength of slow neutrons allows for the large cross section.\n Paragraph 3: The year 1932 was later referred to as the ``annus mirabilis ''for nuclear physics in the Cavendish Laboratory, with discoveries of the neutron, artificial nuclear disintegration by the Cockcroft -- Walton particle accelerator, and the positron.\n Paragraph 4: RRAT J1819-1458 is a Milky Way neutron star and the best studied of the class of rotating radio transients (RRATs) first discovered in 2006.\nQuestion: The person credited with the discovery of the neutron is a participant in what project?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Manhattan Project\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: All Protestant denominations reject the notion of papal supremacy over the Church universal and generally deny the Roman Catholic doctrine of transubstantiation, but they disagree among themselves regarding the real presence of Christ in the Eucharist. The various denominations generally emphasize the priesthood of all believers, the doctrine of justification by faith alone (sola fide) rather than by or with good works, and a belief in the Bible alone (rather than with Catholic tradition) as the highest authority in matters of faith and morals (sola scriptura). The \"Five solae\" summarize the reformers' basic differences in theological beliefs in opposition to the teaching of the Roman Catholic Church of the day.\n Paragraph 2: The novel has been noted for its poignant exploration of different forms of courage. Scout's impulsive inclination to fight students who insult Atticus reflects her attempt to stand up for him and defend him. Atticus is the moral center of the novel, however, and he teaches Jem one of the most significant lessons of courage. In a statement that foreshadows Atticus' motivation for defending Tom Robinson and describes Mrs. Dubose, who is determined to break herself of a morphine addiction, Atticus tells Jem that courage is \"when you're licked before you begin but you begin anyway and you see it through no matter what\".\nQuestion: Who is the guy defending this stuff from the highest authority in Protestantism for morals?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Josh McDowell\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Aaron Spelling (April 22, 1923 – June 23, 2006) was an American film and television producer. Some of his works include the TV programs Charlie's Angels (1976–81), The Love Boat (1977–86), Hart to Hart (1979–84), Dynasty (1981–89), Beverly Hills, 90210 (1990–2000), 7th Heaven (1996–2007), and Charmed (1998–2006). He also served as producer of Mod Squad (1968-1973), The Rookies (1972-1976), and Sunset Beach (1997-1999).\n Paragraph 2: Emily of New Moon is the first in a series of novels by Lucy Maud Montgomery about an orphan girl growing up in Canada. It is similar to the author's \"Anne of Green Gables\" series.\n Paragraph 3: Matthew Richard Bartkowski (born June 4, 1988) is an American professional ice hockey defenseman for the Iowa Wild of the American Hockey League (AHL) while under contract to the Minnesota Wild of the National Hockey League (NHL).\n Paragraph 4: Love/Hate is the second album by English rock band Nine Black Alps. It was recorded by Dave Sardy (Jet, Oasis) in L.A. and is the follow-up to debut album \"Everything Is\" (and Glitter Gulch EP) and was released on October 29, 2007.\n Paragraph 5: The Wild Women of Chastity Gulch is a 1982 American made-for-television western romantic comedy film directed by Philip Leacock and starring Priscilla Barnes, Lee Horsley, Joan Collins, Donny Osmond, Morgan Brittany and Lisa Whelchel. Executive produced by Aaron Spelling, it premiered on ABC on October 31, 1982 and was later syndicated to cable television for rebroadcast.\n Paragraph 6: Lynne Cherry (born January 5, 1952) is an American writer and illustrator of nature-themed children's books and a film producer. In 2009 she was designated a Women's History Month Honoree by the National Women's History Project.\nQuestion: Who wrote a book about growing up in the same nationality as the man who produced The Wild Women of Chastity Gulch?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Min Zhou\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: A Nigerian State is a federated political entity, which shares sovereignty with the Federal Government of Nigeria, There are 36 States in Nigeria, which are bound together by a federal agreement. There is also a territory called the Federal Capital Territory (FCT), which is not a state, but a territory, under the direct control of the Federal Government. The States are further divided into a total of 774 Local Government Areas. Under the Nigerian Constitution, states have the power to ratify constitutional amendments.\n Paragraph 2: Minsk Region or Minsk Voblasć or Minsk Oblast (, \"Minskaja vobłasć\" ; , \"Minskaja oblastj\") is one of the regions of Belarus. Its administrative center is Minsk, although it is a separate administrative territorial entity of Belarus. As of 2011, the region's population is 1,411,500.\n Paragraph 3: The Gerald R. Ford Birthsite and Gardens in Omaha, Nebraska marks the location of the house at 3202 Woolworth Avenue where U.S. President Gerald R. Ford lived for a couple of weeks after his birth in July 1913. It was the home of his paternal grandparents, Charles Henry and Martha King.\n Paragraph 4: The ZEC Bras-Coupé-Desert is a \"zone d'exploitation contrôlée\" (controlled harvesting zone) (ZEC), located in the unorganized territory of Lac-Pythonga in La Vallée-de-la-Gatineau Regional County Municipality, in the administrative region of Outaouais, in Quebec, in Canada.\nQuestion: In which county is Mark Dismore's birthplace located?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Hancock County\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Zhengyou Zhang is a Chinese professor of computer science, IEEE and ACM Fellow and a specialist in computer vision and graphics. He is also a recipient of the 2013 \"Helmholtz Test of Time Award\" which was awarded to him by the International Conference on Computer Vision.\n Paragraph 2: Cell Communication and Signaling is a peer-reviewed and open access scientific journal that publishes original research, reviews and commentaries with a focus on cellular signaling research. It was established in 2003 and is currently published by the London-based publisher BioMed Central.\n Paragraph 3: The East African Legislative Assembly (EALA) is a sub-organ of the larger East African Community, being the legislative arm of the Community. Members are sworn into five-year terms.\nQuestion: Who published the Communications of the group that Zhengyou Zhang is a member of?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Association for Computing Machinery\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Ap Lo Chun () is a small island in the New Territories of Hong Kong. It is located in Ap Chau Bay () between Ap Chau in the east and Sai Ap Chau in the west, with the islet of Ap Tan Pai nearby in the northeast. It is under the administration of North District.\n Paragraph 2: Minsk Region or Minsk Voblasć or Minsk Oblast (, \"Minskaja vobłasć\" ; , \"Minskaja oblastj\") is one of the regions of Belarus. Its administrative center is Minsk, although it is a separate administrative territorial entity of Belarus. As of 2011, the region's population is 1,411,500.\n Paragraph 3: Vilnius County () is the largest of the 10 counties of Lithuania, located in the east of the country around the city Vilnius. On 1 July 2010, the county administration was abolished, and since that date, Vilnius County remains as the territorial and statistical unit.\n Paragraph 4: Wardville is a small unincorporated community in northern Atoka County, Oklahoma, United States, along State Highway 131 14 miles northeast of Coalgate, Oklahoma. The post office was established February 6, 1902 under the name Herbert, Oklahoma. Herbert was located in Atoka County, Choctaw Nation, a territorial-era entity which included portions of today's Atoka, Coal, Hughes and Pittsburg counties. The town was named after Herbert Ward, who was the youngest son of the towns first postmaster, Henry Pleasant Ward. The name of the town was changed to Wardville on July 18, 1907. Wardville was named for the before mentioned Henry Pleasant Ward, who served in the territorial House of Representatives and Senate and was an Atoka County judge. The Wardville Post Office closed in 2007.\nQuestion: What county is the Ira C. Allen Mansion located in?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Monmouth County\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Frank Wicks (30 January 1892 – 26 April 1965) was an English cricketer. He was a wicket-keeper who played for Gloucestershire. He was born in Bristol and died in Ham Green, Somerset.\n Paragraph 2: \"Don't Play No Game That I Can't Win\" is a song by American hip hop group the Beastie Boys, from their eighth studio album \"Hot Sauce Committee Part Two\". Featuring American singer Santigold, the song was released as the fourth and final single from the album on July 26, 2011. \"Don't Play No Game That I Can't Win\" was written and produced by group members Michael \"Mike D\" Diamond, Adam \"MCA\" Yauch and Adam \"Ad-Rock\" Horovitz, with additional writing by Santigold.\n Paragraph 3: Adam Schantz (October 9, 1819 – 1879) was a member of the Wisconsin State Assembly and the Wisconsin State Senate.\n Paragraph 4: Maia Mitchell (born 18 August 1993) is an Australian actress and singer. She is known for her roles as Brittany Flune in the children's television series Mortified for the Nine Network, and as Natasha Ham in the Seven Network's teen drama Trapped. For American audiences, she currently stars in the Freeform drama The Fosters as Callie Adams Foster. She also co-starred with Ross Lynch in the Disney Channel original films Teen Beach Movie and Teen Beach 2 as McKenzie.\nQuestion: Who has played for both West Ham Ajax and the team that Adam Hammill is on?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Mido\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Ap Lo Chun () is a small island in the New Territories of Hong Kong. It is located in Ap Chau Bay () between Ap Chau in the east and Sai Ap Chau in the west, with the islet of Ap Tan Pai nearby in the northeast. It is under the administration of North District.\n Paragraph 2: Territories of the United States are sub-national administrative divisions directly overseen by the United States Federal Government. Unlike U.S. states and Native American tribes which exercise limited sovereignty alongside the federal government, territories are without sovereignty. The territories are classified by whether they are incorporated and whether they have an ``organized ''government through an Organic Act passed by the U.S. Congress.\n Paragraph 3: Summit is a census-designated place (CDP) in Pima County, Arizona, United States. The population was 3,702 at the 2000 census.\n Paragraph 4: Pima County Natural Resources, Parks and Recreation is the agency within Pima County, Arizona that manages the natural resources, parks, and recreation offerings within Pima County including Tucson, AZ.\nQuestion: What's the PBS station located in the city contained within the county where Summit is also located?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"KUAT-TV 6\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: However, from 1971 to 1975, NBA teams played preseason exhibitions against American Basketball Association teams. In the early days of the NBA, league clubs sometimes challenged the legendary barnstorming Harlem Globetrotters, with mixed success. The NBA has played preseason games in Europe and Asia. In the 2006 and 2007 seasons, the NBA and the primary European club competition, the Euroleague, conducted a preseason tournament featuring two NBA teams and the finalists from that year's Euroleague.[citation needed] In the 1998-99 and 2011-12 seasons, teams were limited to only two preseason games due to lockouts.\n Paragraph 2: Eldol () is a legendary king of Britain in Geoffrey of Monmouth's c. 1136 work \"Historia Regum Britanniae\" (\"The History of the Kings of Britain\").\n Paragraph 3: \"Britannia Hospital\" is the final part of Anderson's trilogy of films, written by David Sherwin, that follow the adventures of Mick Travis (portrayed by Malcolm McDowell) as he travels through a strange and sometimes surreal Britain. From his days at boarding school in \"if...\" (1968) to his journey from coffee salesman to film star in \"O Lucky Man!\" (1973), Travis's adventures finally come to an end in \"Britannia Hospital\", which sees Mick as a muckraking reporter investigating the bizarre activities of Professor Millar, played by Graham Crowden, whom he had had a run-in with in \"O Lucky Man\". All three films have characters in common. Some of the characters from \"if...\" that did not turn up in \"O Lucky Man\" return for \"Britannia Hospital\".\nQuestion: Who plays the legendary figure featured in Historia Regum Britanniae in the show Once Upon a Time?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Liam Thomas Garrigan\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Jean Noël Hallé (2 January 1754 – 11 February 1822) was a French physician born in Paris. He was the son of painter Noël Hallé (1711–1781).\n Paragraph 2: Bageshwar is a town and a municipal board in Bageshwar district in the state of Uttarakhand, India. It is located at a distance of 470 km from the National Capital New Delhi and 332 km from the State Capital Dehradun. Bageshwar is known for its scenic beauty, Glaciers, Rivers and Temples. It is also the administrative headquarters of Bageshwar district.\n Paragraph 3: Yaxing Coach (Yangzhou Yaxing Motor Coach Co., Ltd) is a bus manufacturer based in Yangzhou, Jiangsu, China. It is a subsidiary of Jiangsu Yaxing that was founded in 1998. Buses are produced under the \"Yaxing\", \"Yangtse（Yangzlv）\", and more recently Asiastar brands.\n Paragraph 4: Capital is a department located in Salta Province, Argentina. It is the department of the provincial capital, the city of Salta, and the most populated one.\nQuestion: How long had the place of birth of Noel Lee been the capital city of where Yaxing Coah headquarters is located?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"about 400 years\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: NOAA-4, also known as ITOS-G was a weather satellite operated by the National Oceanic and Atmospheric Administration (NOAA). It was part of a series of satellites called ITOS, or improved TIROS. NOAA-4 was launched on a Delta rocket on November 15, 1974. The launch carried two other satellites: AMSAT-OSCAR 7 and Intasat. It remained operational for 1463 days until it was deactivated by NOAA on November 18, 1978.\n Paragraph 2: TDRS-6, known before launch as TDRS-F, is an American communications satellite which is operated by NASA as part of the Tracking and Data Relay Satellite System. It was constructed by TRW, and is based on a custom satellite bus which was used for all seven first generation TDRS satellites.\nQuestion: The space agency operating IRS-P2 had a communication satellite preceded by which experimental satellite?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"ATS - 6 (Applications Technology Satellite - 6)\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Kootingal is a town in New South Wales, Australia in the Tamworth Regional Council area. It is commonly called a satellite suburb of Tamworth because of its closeness and the fact that its residents use Tamworth's services. Founded as an Aboriginal mission, Kootingal traces its name roots to the local Aboriginal Kamilaroi language. At the 2016 census, Kootingal had a population of 2,126 people.\n Paragraph 2: Elizabeth gave birth to her first child, Prince Charles, on 14 November 1948. One month earlier, the King had issued letters patent allowing her children to use the style and title of a royal prince or princess, to which they otherwise would not have been entitled as their father was no longer a royal prince. A second child, Princess Anne, was born in 1950.\n Paragraph 3: In the 9 March 2013 issue of \"People's Democracy\", the central organ of the Communist Party of India (Marxist), lists of candidates of the Left Fronts of West Bengal and Tripura for the 2014 Indian general election were announced. In Tripura both Left Front nominees were CPI(M) leaders. In West Bengal, 32 out of the 42 Left Front candidates came from CPI(M). The newspaper also issued a 'first list' of 25 candidates of the party in other states. The list was finalised at a meeting of the Central Committee of the party in Delhi. The meeting also tasked the Politburo of the party to finalise the election manifesto of the party, to be released at a later date.\n Paragraph 4: Richard Rawle was born in 1812 and educated at Trinity College, Cambridge. After graduation, he was ordained in 1839 and accepted the rectory of Cheadle, Staffordshire. From 1847 to 1864 he was Principal of Codrington College Barbados and then (until his elevation to the Episcopate) Vicar of Tamworth. He died on 10 May 1889.\nQuestion: Who is the child of the person who issued the Tamworth manifesto?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Arthur Peel\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: All the elements from atomic numbers 1 (hydrogen) through 118 (oganesson) have been either discovered or synthesized, completing the first seven rows of the periodic table. The first 98 elements exist in nature, although some are found only in trace amounts and others were synthesized in laboratories before being found in nature. Elements 99 to 118 have only been synthesized in laboratories or nuclear reactors. The synthesis of elements having higher atomic numbers is currently being pursued: these elements would begin an eighth row, and theoretical work has been done to suggest possible candidates for this extension. Numerous synthetic radionuclides of naturally occurring elements have also been produced in laboratories.\n Paragraph 2: During the Second World War, Chadwick carried out research as part of the Tube Alloys project to build an atomic bomb, while his Manchester lab and environs were harassed by Luftwaffe bombing. When the Quebec Agreement merged his project with the American Manhattan Project, he became part of the British Mission, and worked at the Los Alamos Laboratory and in Washington, D.C. He surprised everyone by earning the almost-complete trust of project director Leslie R. Groves, Jr. For his efforts, Chadwick received a knighthood in the New Year Honours on 1 January 1945. In July 1945, he viewed the Trinity nuclear test. After this, he served as the British scientific advisor to the United Nations Atomic Energy Commission. Uncomfortable with the trend toward Big Science, Chadwick became the Master of Gonville and Caius College in 1948. He retired in 1959.\n Paragraph 3: A chemical element is a species of atoms having the same number of protons in their atomic nuclei (that is, the same atomic number, or Z). 118 elements are identified, of which the first 98 occur naturally on Earth with the remaining 20 being synthetic elements. There are 80 elements that have at least one stable isotope and 38 that have exclusively radionuclides, which decay over time into other elements. Iron is the most abundant element (by mass) making up Earth, while oxygen is the most common element in the Earth's crust.\nQuestion: What did the person who discovered that all atoms of an element have the same number of protons participate in?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Manhattan Project\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Magdalene Sibylle of Prussia (31 December 1586 – 12 February 1659) was an Electress of Saxony as the spouse of John George I, Elector of Saxony.\n Paragraph 2: Actress / director / singer Phylicia Rashād is the older sister of performer Debbie Allen, who is married to former NBA basketball player, Norm Nixon. Phylicia Rashād is the former spouse of both Victor Willis, former lead singer of the group Village People, and former NFL football player turned sportscaster, Ahmad Rashād. Phylicia and Ahmad Rashād are the parents of actress Condola Rashād.\n Paragraph 3: If an asset is left to a spouse or a federally recognized charity, the tax usually does not apply. In addition, a maximum amount, varying year by year, can be given by an individual, before and / or upon their death, without incurring federal gift or estate taxes: $5,340,000 for estates of persons dying in 2014 and 2015, $5,450,000 (effectively $10.90 million per married couple, assuming the deceased spouse did not leave assets to the surviving spouse) for estates of persons dying in 2016. Because of these exemptions, it is estimated that only the largest 0.2% of estates in the U.S. will pay the tax. For 2017, the exemption increases to $5.5 million. In 2018, the exemption will double to $11.18 million per taxpayer due to the Tax Cuts and Jobs Act of 2017.\nQuestion: Who married the actor from Terminator?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Maria Shriver\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Firstly conceived and still used today for optical storage devices (CD-RW drives, DVD drives, etc.), several manufacturers offer external portable USB hard disk drives, or empty enclosures for disk drives. These offer performance comparable to internal drives, limited by the current number and types of attached USB devices, and by the upper limit of the USB interface (in practice about 30 MB/s for USB 2.0 and potentially 400 MB/s or more for USB 3.0). These external drives typically include a \"translating device\" that bridges between a drive's interface to a USB interface port. Functionally, the drive appears to the user much like an internal drive. Other competing standards for external drive connectivity include eSATA, ExpressCard, FireWire (IEEE 1394), and most recently Thunderbolt.\n Paragraph 2: The third generation began including a 30-pin dock connector, allowing for FireWire or USB connectivity. This provided better compatibility with non-Apple machines, as most of them did not have FireWire ports at the time. Eventually Apple began shipping iPods with USB cables instead of FireWire, although the latter was available separately. As of the first-generation iPod Nano and the fifth-generation iPod Classic, Apple discontinued using FireWire for data transfer (while still allowing for use of FireWire to charge the device) in an attempt to reduce cost and form factor. As of the second-generation iPod Touch and the fourth-generation iPod Nano, FireWire charging ability has been removed. The second-, third-, and fourth-generation iPod Shuffle uses a single 3.5 mm minijack phone connector which acts as both a headphone jack and a data port for the dock.\nQuestion: What does dell call the feature letting the interface replacing FireWire in later iterations of the iPod drives to remain powered when the computer is off?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"PowerShare\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Ravil Velimukhamedovich Aryapov (; born February 1, 1948 in Stavropol, now Tolyatti) is a Russian professional football coach and a former player. As of July 2009, he is an assistant coach with the reserve team of FC Krylia Sovetov Samara.\n Paragraph 2: The genus \"Darwinius\" was named in commemoration of the bicentenary of the birth of Charles Darwin, and the species name \"masillae\" honors Messel where the specimen was found. The creature appeared superficially similar to a modern lemur.\nQuestion: Whom is the birth place of Ravil Aryapov named after?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Palmiro Togliatti\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: James Howard Bryant (born June 2, 1929) is a singer, arranger and composer. He is most well known for providing the singing voice of Tony (played onscreen by Richard Beymer) in the 1961 film musical West Side Story. While he received no screen credit, he states that Beymer was ``a nice guy, and every time he did an interview he would mention my name. ''He also sang for James Fox in the 1967 film musical Thoroughly Modern Millie, and sang in`` The Telephone Hour'' number in Bye Bye Birdie. He also sang in the group that performed the theme song of the TV series Batman.\n Paragraph 2: Charles Louis Brown (August 22, 1936 – May 16, 2012) was an American guitarist, bandleader and singer who has garnered the honorific nickname \"The Godfather of Go-Go\". Go-go is a subgenre of funk music developed in and around the Washington metropolitan area in the mid-1970s. While its musical classification, influences, and origins are debated, Brown is regarded as the fundamental force behind the creation of go-go music.\n Paragraph 3: ``Is She Really Going Out with Him? ''is the first single released by British musician Joe Jackson in September 1978. The track, which was to achieve greater commercial success when reissued in 1979, was included on Jackson's debut album, Look Sharp!.\n Paragraph 4: Dead Air is a 2009 American science fiction-horror film directed by Corbin Bernsen and starring Bill Moseley and Patricia Tallman. The story focuses on a radio station that warns its listeners after an explosion unleashes zombies into Los Angeles. Screenwriter Kenny Yakkel explained before the film's release that the \"undead\" presented are not actual zombies: \"It's like a PCP zombie movie, that's my take on it 'cause they're not really dead.\"\nQuestion: Who played who sang is she really going out with him in the who influenced Beyonce movie?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Lawrence Hilton - Jacobs\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Art of Life Live is an X Japan live album released on March 18, 1998. It is composed solely of one song, \"Art of Life\". Mostly recorded on December 31, 1993 (the piano solo part is from the night before) at the Tokyo Dome. The album reached number 20 on the Oricon chart. This same performance was released on DVD and VHS, as \"Art of Life 1993.12.31 Tokyo Dome\", five years later.\n Paragraph 2: \"A Perfect Sky\" is Bonnie Pink's twenty-fifth single and first from the album \"Thinking Out Loud\". The single was released under the Warner Music Japan label on June 28, 2006.\n Paragraph 3: Carryin' On is an album by American jazz guitarist Grant Green featuring performances recorded in 1969 and released on the Blue Note label. The album marked Green's return to the Blue Note label and embracing a jazz-funk style that he would play for the rest of his life.\n Paragraph 4: Living Loud was a recording project featuring bass player and songwriter Bob Daisley, Uriah Heep drummer Lee Kerslake, guitarist Steve Morse of Deep Purple and Cold Chisel singer Jimmy Barnes. Deep Purple keyboards player Don Airey made a guest appearance.\nQuestion: What label was responsible for the performer of Live Life Loud?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Fair Trade Services\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: J. Beez Wit the Remedy is the third album by the Jungle Brothers, released during June 22, 1993 (see 1993 in music) on Warner Bros. Records. The album was the result of much label trouble, where Warner Bros. constantly rejected the group's offerings. The album in gestation was originally titled \"Crazy Wisdom Masters\" and features some considerably experimental hip-hop for the time, as well as production from Bill Laswell. Though the final album is considerably more conventional, experimental tracks are still in evidence, including a few left over from the \"Crazy Wisdom Masters\" sessions (e.g. \"Spittin' Wicked Randomness,\" \"For The Headz At Company Z\"). A few additional tracks from the \"Wisdom\" sessions have been bootlegged or leaked online.\n Paragraph 2: One-Trick Pony, Paul Simon's fifth solo studio album, was released in 1980. It was Simon's first album for Warner Bros. Records, and his first new studio album since 1975's \"Still Crazy After All These Years.\" His back catalog from Columbia Records would also move to Warner Bros. as a result of his signing with the label.\n Paragraph 3: Love, Simon (Original Motion Picture Soundtrack) Soundtrack album by Various artists Released March 16, 2018 Genre Soundtrack indie pop Length 47: 24 Label RCA Sony Singles from Love, Simon (Original Motion Picture Soundtrack) ``Alfie's Song (Not So Typical Love Song) ''Released: 16 January 2018`` Love Lies'' Released: 14 February 2018\nQuestion: What label is responsible for the performer of Crazy Love?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Fair Trade Services\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Godless, a young adult novel by Pete Hautman, was published in 2004 by Simon & Schuster. It won the annual U.S. National Book Award for Young People's Literature.\n Paragraph 2: John Brockman (born February 16, 1941 in Boston, Massachusetts) is a literary agent and author specializing in scientific literature. He founded the Edge Foundation, an organization aimed to bring together people working at the edge of a broad range of scientific and technical fields.\n Paragraph 3: Bērziņš was born on 16 July 1888 at Ķoņi parish (today – in Latvia, near the border with Estonia) in a family of farmworker for-hire. His level of education is uncertain, but it is known that initially he worked as a herder and later as a factory worker. In 1905 Bērziņš joined the Russian Social Democratic Labour Party and since 1909 he worked as a teacher. In 1911 Bērziņš was arrested for spreading a Bolshevik propaganda literature and over a year spent in prison.\n Paragraph 4: The PEN/Edward and Lily Tuck Award for Paraguayan Literature is awarded by the PEN American Center to honor an author of a major work of Paraguayan literature and the English translator. The award was established by author Lily Tuck to assist with the translation of Paraguayan literature from Spanish or Guarani into English. Tuck won a National Book Award in 2004 for \"The News from Paraguay\", which was set in 19th century Paraguay. Michael Orthofer of \"complete review\" called it \"my new favorite American literary award,\" for its coverage of an overlooked area of world literature.\nQuestion: How many people work in the publisher of World Literature Today?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"11,900\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: In 2013 tourism within the state from local citizens accounted for 39.9% of tourists, the second highest originating location for tourists to Tennessee is the state of Georgia, accounting for 8.4% of tourists.:17 Forty-four percent of stays in the state were \"day trips\", 25% stayed one night, 15% stayed two nights, and 11% stayed 4 or more nights. The average stay was 2.16 nights, compared to 2.03 nights for the US as a whole.:40 The average person spent $118 per day: 29% on transportation, 24% on food, 17% on accommodation, and 28% on shopping and entertainment.:44\n Paragraph 2: A Nigerian State is a federated political entity, which shares sovereignty with the Federal Government of Nigeria, There are 36 States in Nigeria, which are bound together by a federal agreement. There is also a territory called the Federal Capital Territory (FCT), which is not a state, but a territory, under the direct control of the Federal Government. The States are further divided into a total of 774 Local Government Areas. Under the Nigerian Constitution, states have the power to ratify constitutional amendments.\n Paragraph 3: In March's Super Tuesday, Kerry won decisive victories in the California, Connecticut, Georgia, Maryland, Massachusetts, New York, Ohio, and Rhode Island primaries and the Minnesota caucuses. Dean, despite having withdrawn from the race two weeks earlier, won his home state of Vermont. Edwards finished only slightly behind Kerry in Georgia, but, failing to win a single state other than South Carolina, chose to withdraw from the presidential race. Sharpton followed suit a couple weeks later. Kuninch did not leave the race officially until July.\n Paragraph 4: Roxbury High Fort is a historic fort site on Beech Glen Street at Fort Avenue in the Roxbury neighborhood of Boston, Massachusetts. The site now contains a small park and the Cochituate Standpipe, also known as Fort Hill Tower, built in 1869. The fort site was added to the National Register of Historic Places in 1973. The site inspired the name of the Fort Hill neighborhood which surrounds the area of the High Fort.\nQuestion: Edwards won the primary in a state excluding the state that sent the most tourists in to Tennessee in 2013. Who has the most national championships between that state's university and Fort Hill's city's university?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"University of South Carolina\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: \"You and Your Sister\" is a song by the American singer-songwriter Chris Bell, that appears on his only solo album \"I Am the Cosmos\". It was released as a B-side to Bell's only single \"I Am the Cosmos.\" The song is very similar in composition, vocals, and guitar playing to Big Star's \"Thirteen,\" which Bell co-wrote with band mate Alex Chilton, as it is also an acoustic love ballad. It features backing vocals by Chilton.\n Paragraph 2: Nick Jonas as Jefferson ``Seaplane ''McDonough, a young aircraft pilot in Jumanji who is Alex Vreeke's avatar. Mason Guccione as Alex Vreeke, a teenage gamer who was trapped inside the Jumanji video game for two decades. Colin Hanks plays the adult Alex when he appears two decades later.\n Paragraph 3: The character was played by Claudia Wells in Back to the Future. However, Wells was not available to film the sequels for personal reasons, and the role was recast to Elisabeth Shue although Wells reprised her role as Jennifer in Back to the Future: The Game as a punk rock version of her character. Consequently, the opening scene of Back to the Future Part II was re-shot with Shue taking Wells' place, rather than using the ending of Back to the Future. In the spin - off Back to the Future: the Animated Series, Jennifer was voiced by Cathy Cavadini.\nQuestion: Who played the girlfriend of Alex P. Keaton's actor on Family Ties in Back to the Future?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Claudia Wells\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Middle Valley is a census-designated place (CDP) in Hamilton County, Tennessee, United States. The population was 12,684 at the 2010 census. It is part of the Chattanooga, TN–GA Metropolitan Statistical Area.\n Paragraph 2: Saint Stephen's Day, or the Feast of Saint Stephen, is a Christian saint's day to commemorate Saint Stephen, the first Christian martyr or protomartyr, celebrated on 26 December in the Latin Church and 27 December in Eastern Christianity. The Eastern Orthodox Church adheres to the Julian calendar and mark Saint Stephen's Day on 27 December according to that calendar, which places it on 9 January of the Gregorian calendar used in secular contexts. In Latin Christian denominations, Saint Stephen's Day marks the second day of Christmastide.\n Paragraph 3: In the Bible, it is not as precisely defined as other Biblical measurements of distance; the distance has been estimated from 32 to 40 kilometers (20 -- 25 miles).\n Paragraph 4: Colonial Heights is a census-designated place (CDP) in Sullivan County, Tennessee, United States. The population was 6,934 at the 2010 census. It is part of the Kingsport–Bristol (TN)–Bristol (VA) Metropolitan Statistical Area, which is a component of the Johnson City–Kingsport–Bristol, TN-VA Combined Statistical Area – commonly known as the \"Tri-Cities\" region.\nQuestion: How many miles are there between Nashville and the place in Tennessee where Mark Day was born?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"45\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Formed in 1878, Everton were founding members of The Football League in 1888 and won their first League Championship two seasons later. Following four League Championship and two FA Cup wins, Everton experienced a lull in the immediate post World War Two period, until a revival in the 1960s, which saw the club win two League Championships and an FA Cup. The mid-1980s represented their most recent period of sustained success, with two League Championships, an FA Cup, and the 1985 European Cup Winners' Cup. The club's most recent major trophy was the 1995 FA Cup.\n Paragraph 2: He began his career at Nottingham Forest, becoming the youngest player ever to play for the club when he made his first team debut in October 2001 at the age of 16. He was loaned out to Lincoln City and Milton Keynes Dons in 2005, before he left the Football League to spend the 2005–06 season in the Conference with Cambridge United. He then spent three seasons with Kettering Town, helping the club to win the Conference North title in 2007–08. He signed with Notts County in May 2009, and helped the club to win the League Two title in 2009–10. He was sold on to Chesterfield in August 2011, and won the Football League Trophy with the club in 2012, scoring a goal in the final. He joined Walsall, initially on loan, in November 2012. He finished as the club's top-scorer in the 2013–14 campaign, but was released in May 2014. On 17 June 2014 Westcarr joined Portsmouth on a free transfer after leaving Walsall, penning a two-year contract.\n Paragraph 3: The 1914 FA Cup Final was a football match between Burnley and Liverpool on 25 April 1914 at Crystal Palace, London. It was the final match of the 1913–14 FA Cup, the 43rd season of the country's primary cup competition, the Football Association Challenge Cup, better known as the FA Cup. Both teams were appearing in their first final.\nQuestion: When did the sports team that Craig Westcarr played for win the fa cup?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"1898 and 1959\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: USS \"Peril\" (AM-272) was an built for the United States Navy during World War II and in commission from 1944 to 1945. In 1945, she was transferred to the Soviet Union and after that served in the Soviet Navy as T-281.\n Paragraph 2: The coastline is inhabited by marine mammals, like sea lions, elephant seals and fur seals. Southern right whales can be found in Golfo Nuevo and Golfo San José, protected bodies of water located between the peninsula and the Patagonian mainland. These baleen whales come here between May and December, for mating and giving birth, because the water in the gulf is quieter and warmer than in the open sea. Orcas can be found off the coast, in the open sea off the peninsula. In this area, they are known to beach themselves on shore to capture sea lions and elephant seals.\n Paragraph 3: The Seal River is a river in the Northern Region of Manitoba, Canada. It travels from Shethanei Lake to the Hudson Bay. The river was nominated for the Canadian Heritage Rivers System in 1987 and was officially listed in 1992.\n Paragraph 4: Seals was drafted in the first round by the Utah Stars, playing two seasons in the ABA before being drafted into the NBA in the second round by the Seattle SuperSonics in 1975. Seals played three seasons in the NBA.\nQuestion: What does seal stand for in the seals of the service operating list of destroyer classes of the operator of USS Peril?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Sea, Air, and Land\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Brücke Museum in Berlin houses the world's largest collection of works by \"Die Brücke\" (\"The Bridge\"), an early 20th-century expressionist movement.\n Paragraph 2: The BTR-4 \"Bucephalus\" (BTR; / Bronetransporter, literally Armoured Transporter) is an amphibious 8x8 wheeled armoured personnel carrier (APC) designed in Ukraine by the Kharkiv Morozov Machine Building Design Bureau (SOE KMDB) as a private venture. The prototype, which was designed as a private venture, was unveiled at the Aviasvit 2006 exhibition held in Ukraine in June 2006. It is currently operated by Iraq, Kazakhstan, Nigeria, and Ukraine, with up to 500 vehicles produced for all operators. It is availible in multiple different configurations, including but not limited to an ambulance, armoured recovery vehicle, and infantry support version. They have seen action in both the War in Donbass, and the capture of Jurf Al Nasr from ISIL.\n Paragraph 3: And Then You Die is a novel by Michael Dibdin, and is the eighth entry in the popular Aurelio Zen series.\n Paragraph 4: Viel is the seventh studio album of the German hip hop group Die Fantastischen Vier. It peaked at #2 on the German and Austrian charts and #4 in Switzerland.\nQuestion: When did the owner of Bucephalus die?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"323 BC\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Supreme Court Building is the seat of the Supreme Court of the United States and the Judicial Branch thereof. Completed in 1935, it is situated in Washington, D.C. at 1 First Street, NE, on the block immediately east of the United States Capitol. The building is under the jurisdiction of the Architect of the Capitol. On May 4, 1987, the Supreme Court Building was designated a National Historic Landmark.\n Paragraph 2: Sandra Day O'Connor (born March 26, 1930) is a retired Associate Justice of the Supreme Court of the United States, serving from her appointment in 1981 by Ronald Reagan to 2006. She was the first woman to serve on the Court.\nQuestion: Where was the first woman appointed to the Supreme Court educated?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Stanford University\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Secretary of State for India or India Secretary was the British Cabinet minister and the political head of the India Office responsible for the governance of the British Raj (India), Aden, and Burma. The post was created in 1858 when the East India Company's rule in Bengal ended and India except for the Princely States was brought under the direct administration of the government in London, beginning the official colonial period under the British Empire.\n Paragraph 2: Colonial India Imperial entities of India Dutch India 1605 -- 1825 Danish India 1620 -- 1869 French India 1668 -- 1954 Portuguese India (1505 -- 1961) Casa da Índia 1434 -- 1833 Portuguese East India Company 1628 -- 1633 British India (1612 -- 1947) East India Company 1612 -- 1757 Company rule in India 1757 -- 1858 British Raj 1858 -- 1947 British rule in Burma 1824 -- 1948 Princely states 1721 -- 1949 Partition of India 1947\n Paragraph 3: Kohat (Urban-VI) is an administrative unit known as “Union Council” of Kohat District in the Khyber Pakhtunkhwa province of Pakistan.\n Paragraph 4: According to Census of India of 2001, India has 122 major languages and 1599 other languages. However, figures from other sources vary, primarily due to differences in definition of the terms ``language ''and`` dialect''. The 2001 Census recorded 30 languages which were spoken by more than a million native speakers and 122 which were spoken by more than 10,000 people. Two contact languages have played an important role in the history of India: Persian and English. Persian was the court language during the Mughal period in India. It reigned as an administrative language for several centuries until the era of British colonisation. English continues to be an important language in India. It is used in higher education and in some areas of the Indian government. Hindi, the most widely spoken language in a large region of India today, serves as the lingua franca across much of North and Central India. However, there have been anti-Hindi agitations in South India, most notably in the states of Tamil Nadu. There is also opposition in non-Hindi belt states towards imposition of Hindi in these areas.\nQuestion: What is the meaning of the word that is also a majority religion in the region that became India when the country where Kohat is located was created in the Arabic dictionary?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"the country of India\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The strategy behind the formation of the Warsaw Pact was driven by the desire of the Soviet Union to dominate Central and Eastern Europe. This policy was driven by ideological and geostrategic reasons. Ideologically, the Soviet Union arrogated the right to define socialism and communism and act as the leader of the global socialist movement. A corollary to this idea was the necessity of intervention if a country appeared to be violating core socialist ideas and Communist Party functions, which was explicitly stated in the Brezhnev Doctrine. Geostrategic principles also drove the Soviet Union to prevent invasion of its territory by Western European powers.\n Paragraph 2: The first half of the 20th century in Russia and the Soviet Union was marked by a succession of wars, famines and other disasters, each accompanied by large-scale population losses. Stephen J. Lee estimates that, by the end of World War II in 1945, the Russian population was about 90 million fewer than it could have been otherwise.\nQuestion: By approximately what percentage did the Black Death reduce the population of the region that the Soviet Union feared invasion from?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"30% to 65%\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: China shares international borders with 14 sovereign states. In addition, there is a 30 - km border with the special administrative region of Hong Kong, which was a British dependency before 1997, and a 3 km border with Macau, a Portuguese territory until 1999. With a land border of 22,117 kilometres (13,743 mi) in total it also has the longest land border of any country.\n Paragraph 2: Radwanice () is a village in Polkowice County, Lower Silesian Voivodeship, in south-western Poland. It is the seat of the administrative district (gmina) called Gmina Radwanice.\nQuestion: What shares a border with the administrative territorial entity Radwanice, Polkowice County is located in?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Gmina Gaworzyce\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Bad Man is a 1930 American Pre-Code Western film starring Walter Huston which was produced and released by First National Pictures, a subsidiary of Warner Bros. The movie is based on Porter Emerson Browne's 1920 play of the same name and is a sound remake of the 1923 silent version of the same name. The film stars Walter Huston, Dorothy Revier, Sidney Blackmer and James Rennie.\n Paragraph 2: Timothy Wallace Credeur II (born July 9, 1977) is a retired American mixed martial artist. He was a cast member of SpikeTV's \"The Ultimate Fighter 7\" and was defeated by fellow cast member Jesse Taylor in the semi-finals. He was then brought back into the competition following the disqualification of Taylor. He fought C.B. Dollaway for a spot in the finals and lost to Dollaway via decision.\n Paragraph 3: The Good, the Bad and the Ugly: Original Motion Picture Soundtrack was released in 1966 alongside the Western film, The Good, the Bad and the Ugly, directed by Sergio Leone. The score is composed by frequent Leone collaborator Ennio Morricone, whose distinctive original compositions, containing gunfire, whistling, and yodeling permeate the film. The main theme, resembling the howling of a coyote, is a two - note melody that is a frequent motif, and is used for the three main characters, with a different instrument used for each one: flute for Blondie (Man With No Name), Arghilofono (Ocarina) for Angel Eyes, and human voices for Tuco.\nQuestion: What was the cast member of The Bad Man nominated for?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Academy Award for Best Supporting Actor\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Turkish authorities deny the genocide took place to this day. The Armenian Genocide is acknowledged to have been one of the first modern genocides. According to the research conducted by Arnold J. Toynbee, an estimated 600,000 Armenians died during deportation from 1915–16). This figure, however, accounts for solely the first year of the Genocide and does not take into account those who died or were killed after the report was compiled on the 24th May 1916. The International Association of Genocide Scholars places the death toll at \"more than a million\". The total number of people killed has been most widely estimated at between 1 and 1.5 million.\n Paragraph 2: The 22nd century will be a century of the Anno Domini or Common Era in accordance with the Gregorian calendar. It will be the century following the current 21st century, beginning on January 1, 2101 and ending on December 31, 2200.\n Paragraph 3: Quadragesimo anno (Latin for \"In the 40th Year\") is an encyclical issued by Pope Pius XI on 15 May 1931, 40 years after Leo XIII's encyclical \"Rerum novarum,\" further developing Catholic social teaching. Unlike Leo XIII, who addressed the condition of workers, Pius XI discusses the ethical implications of the social and economic order. He describes the major dangers for human freedom and dignity arising from unrestrained capitalism, socialism, and totalitarian communism. He also calls for the reconstruction of the social order based on the principles of solidarity and subsidiarity.\n Paragraph 4: The name Vatican city was first used in the Lateran Treaty, signed on 11 February 1929, which established the modern city - state. The name is taken from Vatican Hill, the geographic location of the state. ``Vatican ''is derived from the name of an Etruscan settlement, Vatica or Vaticum meaning garden, located in the general area the Romans called vaticanus ager,`` Vatican territory''.\nQuestion: When did the place of death of the author of Quadragesimo Anno become its own country?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"11 February 1929\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: Rahel Radiansyah (born May 22, 1991) is an Indonesian footballer who currently plays for Martapura in the Liga 2. He also plays for Persisam Putra Samarinda U-21, with this reserve team he scored 11 goals in two season.\n Paragraph 2: Texas Declaration of Independence 1836 facsimile of the Texas Declaration of Independence Created March 2, 1836 Ratified March 3, 1836 Location Engrossed copy: Texas State Library and Archives Commission Signatories 60 delegates to the Consultation Purpose To announce and explain separation from Mexico\nQuestion: Who is the president of the newly declared independent country that is part of the Commission of Truth and Friendship with Radiansyah's birth country?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"Francisco Guterres\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Magic City Jazz Orchestra (MCJO) is an American jazz ensemble which was founded in 1999 as a spin-off of the SuperJazz Big Band (formerly UAB SuperJazz) by Birmingham, Alabama jazz pianist and vocalist Ray Reach. The mission of the group is to \"...perform and record big band jazz music written by well known but under-recorded jazz artists.\" (From the Mission Statement of the MCJO bylaws.)\n Paragraph 2: Barefoot on the Beach is a smooth jazz album by American singer-songwriter Michael Franks, released in 1999 by Windham Hill Records.\n Paragraph 3: 2 Horns / 2 Rhythm is an album by American jazz trumpeter Kenny Dorham featuring performances with Ernie Henry recorded in 1957 and released on the Riverside label. This was Henry's last recording session.\n Paragraph 4: Easterly Winds is an album by American jazz pianist Jack Wilson featuring performances recorded and released on the Blue Note label in 1967.\nQuestion: Along with Kenny G and the performer of Off the Beaten Path, what artist was featured on smooth jazz stations?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"George Benson\"}"
      },
      {
        "question": "Given the following context and question, answer the question.\nContext: Paragraph 1: The Minikahda Club is a golf club and course located in southwest Minneapolis, Minnesota, just west of Lake Calhoun. The course hosted the U.S. Open in 1916, the U.S. Amateur in 1927, and the Walker Cup in 1957.\n Paragraph 2: A common misconception is that the Cape of Good Hope is the southern tip of Africa. This misconception was based on the misbelief that the Cape was the dividing point between the Atlantic and Indian Oceans. Contemporary geographic knowledge instead states the southernmost point of Africa is Cape Agulhas about 150 kilometres (90 mi) to the east - southeast. The currents of the two oceans meet at the point where the warm - water Agulhas current meets the cold water Benguela current and turns back on itself. That oceanic meeting point fluctuates between Cape Agulhas and Cape Point (about 1.2 kilometres (0.75 mi) east of the Cape of Good Hope).\n Paragraph 3: Walker Pond is a body of water in Sturbridge, Massachusetts, situated off Route 49 on the way to Wells State Park.\n Paragraph 4: Blooming Grove is an unincorporated community in northeastern North Bloomfield Township, Morrow County, Ohio, United States. The community is located at the junction of State Route 97 and Morrow County Road 20. The nearest city is Galion, Ohio, located to the northwest. Mount Gilead, the county seat of Morrow County, is located southwest of Blooming Grove on State Route 61.\nQuestion: Where does the body of water by the city where The Minikahda Club is located and the Ohio River meet?",
        "reference_answers": [
          ""
        ],
        "should_abstain": true,
        "metadata_json": "{\"actual_answer\": \"at the city of Cairo, Illinois\"}"
      }
    ]
  }
}
